Repository: gloriafinance/gloria_finance_front
Catalog: lib/l10n/app_*.arb
Languages: es, pt

# settings_cost_center_help_code
source: Use an easy-to-remember code with up to {maxLength} characters.
es: Usa un código fácil de recordar de hasta {maxLength} caracteres.
pt: Use um código fácil de lembrar com até {maxLength} caracteres.

# settings_cost_center_help_description
source: Describe briefly how this cost center will be used.
es: Describe de forma objetiva cómo se utilizará este centro de costo.
pt: Descreva de forma objetiva como este centro de custo será utilizado.

# settings_cost_center_save
source: Save
es: Guardar
pt: Salvar

# settings_cost_center_update
source: Update
es: Actualizar
pt: Atualizar

# settings_cost_center_toast_saved
source: Record saved successfully
es: Registro guardado con éxito
pt: Registro salvo com sucesso

# settings_cost_center_toast_updated
source: Record updated successfully
es: Registro actualizado con éxito
pt: Registro atualizado com sucesso

# settings_financial_concept_title
source: Financial concepts
es: Conceptos financieros
pt: Conceitos financeiros

# settings_financial_concept_new
source: New concept
es: Nuevo concepto
pt: Novo conceito

# settings_financial_concept_filter_all
source: All
es: Todos
pt: Todos

# settings_financial_concept_filter_by_type
source: Filter by type
es: Filtrar por tipo
pt: Filtrar por tipo

# settings_financial_concept_field_name
source: Name
es: Nombre
pt: Nome

# settings_financial_concept_field_description
source: Description
es: Descripción
pt: Descrição

# settings_financial_concept_field_type
source: Concept type
es: Tipo de concepto
pt: Tipo de conceito

# settings_financial_concept_field_statement_category
source: Statement category
es: Categoría del estado
pt: Categoria do demonstrativo

# settings_financial_concept_field_active
source: Active
es: Activo
pt: Ativo

# settings_financial_concept_indicators_title
source: Accounting indicators
es: Indicadores contables
pt: Indicadores contábeis

# settings_financial_concept_indicator_cash_flow
source: Impacts cash flow
es: Impacta flujo de caja
pt: Impacta fluxo de caixa

# settings_financial_concept_indicator_result
source: Impacts result (P&L)
es: Impacta el resultado (DRE)
pt: Impacta o resultado (DRE)

# settings_financial_concept_indicator_balance
source: Impacts balance sheet
es: Impacta el balance general
pt: Impacta o balanço patrimonial

# settings_financial_concept_indicator_operational
source: Recurring operational event
es: Evento operacional recurrente
pt: Evento operacional recorrente

# settings_financial_concept_error_required
source: Required field
es: Campo obligatorio
pt: Campo obrigatório

# settings_financial_concept_error_select_type
source: Select a type
es: Selecciona el tipo
pt: Selecione o tipo

# settings_financial_concept_error_select_category
source: Select a category
es: Selecciona la categoría
pt: Selecione a categoria

# settings_financial_concept_help_statement_categories
source: Understand the categories
es: Entender las categorías
pt: Entenda as categorias

# settings_financial_concept_help_indicators
source: Understand the indicators
es: Entender los indicadores
pt: Entenda os indicadores

# settings_financial_concept_save
source: Save
es: Guardar
pt: Salvar

# settings_financial_concept_toast_saved
source: Record saved successfully
es: Registro guardado con éxito
pt: Registro salvo com sucesso

# settings_financial_concept_help_statement_title
source: Statement categories
es: Categorías del estado
pt: Categorias do demonstrativo

# settings_financial_concept_help_indicator_intro
source: These indicators determine how the concept will be reflected in financial reports. They can be adjusted as needed for specific cases.
es: Estos indicadores determinan cómo se reflejará el concepto en los informes financieros. Pueden ajustarse según sea necesario para casos específicos.
pt: Esses indicadores determinam como o conceito será refletido nos relatórios financeiros. Eles podem ser ajustados conforme necessário para casos específicos.

# settings_financial_concept_help_indicator_cash_flow_title
source: Impacts cash flow
es: Impacta flujo de caja
pt: Impacta fluxo de caixa

# settings_financial_concept_help_indicator_cash_flow_desc
source: Check when the entry changes the available balance after payment or receipt.
es: Márquelo cuando el movimiento cambie el saldo disponible después del pago o cobro.
pt: Marque quando o lançamento altera o saldo disponível após o pagamento ou recebimento.

# settings_financial_concept_help_indicator_result_title
source: Impacts result (P&L)
es: Impacta el resultado (DRE)
pt: Impacta o resultado (DRE)

# settings_financial_concept_help_indicator_result_desc
source: Use when the amount should be part of the income statement, affecting profit or loss.
es: Úsalo cuando el valor deba componer el estado de resultados, afectando ganancias o pérdidas.
pt: Use quando o valor deve compor a Demonstração do Resultado, afetando lucro ou prejuízo.

# settings_financial_concept_help_indicator_balance_title
source: Impacts balance sheet
es: Impacta el balance general
pt: Impacta o balanço patrimonial

# settings_financial_concept_help_indicator_balance_desc
source: Select for events that create or settle assets and liabilities directly in the balance sheet.
es: Selecciona para eventos que crean o liquidan activos y pasivos directamente en el balance.
pt: Selecione para eventos que criam ou liquidam ativos e passivos diretamente no balanço.

# settings_financial_concept_help_indicator_operational_title
source: Recurring operational event
es: Evento operacional recurrente
pt: Evento operacional recorrente

# settings_financial_concept_help_indicator_operational_desc
source: Enable for routine commitments in the church's day-to-day operations, related to core activities.
es: Habilítalo para compromisos rutinarios del día a día de la iglesia, ligados a las operaciones principales.
pt: Habilite para compromissos rotineiros do dia a dia da igreja, ligados às operações principais.

# settings_financial_concept_help_understood
source: Got it
es: Entendido
pt: Entendi

# bankStatements_empty_title
source: No statements imported yet.
es: Aún no hay extractos importados.
pt: Nenhum extrato importado ainda.

# bankStatements_empty_subtitle
source: Import a CSV file to start bank reconciliation.
es: Importa un archivo CSV para iniciar la conciliación bancaria.
pt: Importe um arquivo CSV para iniciar a conciliação bancária.

# bankStatements_header_date
source: Date
es: Fecha
pt: Data

# bankStatements_header_bank
source: Bank
es: Banco
pt: Banco

# bankStatements_header_description
source: Description
es: Descripción
pt: Descrição

# bankStatements_header_amount
source: Amount
es: Importe
pt: Valor

# bankStatements_header_direction
source: Direction
es: Dirección
pt: Direção

# bankStatements_header_status
source: Status
es: Estado

# bankStatements_action_details
source: Details
es: Detalles
pt: Detalhes

# bankStatements_action_retry
source: Retry
es: Reprocesar
pt: Reprocessar

# bankStatements_action_link
source: Link
es: Vincular
pt: Vincular

# bankStatements_action_linking
source: Linking...
es: Vinculando...
pt: Vinculando...

# bankStatements_toast_auto_reconciled
source: Statement reconciled automatically.
es: Extracto conciliado automáticamente.
pt: Extrato conciliado automaticamente.

# bankStatements_toast_no_match
source: No matching transaction found.
es: No se encontró ningún movimiento correspondiente.
pt: Nenhum lançamento correspondente encontrado.

# bankStatements_details_title
source: Bank statement details
es: Detalles del extracto bancario
pt: Detalhes do extrato bancário

# bankStatements_toast_link_success
source: Statement linked successfully.
es: Extracto vinculado con éxito.
pt: Extrato vinculado com sucesso.

# settings_financial_months_empty
source: No financial months found.
es: No se encontró ningún mes financiero.
pt: Nenhum mês financeiro encontrado.

# settings_financial_months_header_month
source: Month
es: Mes
pt: Mês

# settings_financial_months_header_year
source: Year
es: Año
pt: Ano

# settings_financial_months_header_status
source: Status
es: Estado

# settings_financial_months_action_reopen
source: Reopen
es: Reabrir
pt: Reabrir

# settings_financial_months_action_close
source: Close
es: Cerrar
pt: Fechar

# settings_financial_months_modal_close_title
source: Close month
es: Cerrar mes
pt: Fechar Mês

# settings_financial_months_modal_reopen_title
source: Reopen month
es: Reabrir mes
pt: Reabrir Mês

# accountsReceivable_list_title
source: Accounts receivable list
es: Lista de cuentas por cobrar
pt: Lista de contas a receber

# accountsReceivable_list_title_mobile
source: Accounts receivable
es: Cuentas por cobrar
pt: Contas a receber

# accountsReceivable_list_new
source: Register account receivable
es: Registrar cuenta por cobrar
pt: Registrar conta a receber

# accountsReceivable_table_empty
source: No accounts receivable to show
es: No hay cuentas por cobrar para mostrar
pt: Nenhuma conta a receber encontrada

# accountsReceivable_table_header_debtor
source: Debtor
es: Deudor
pt: Devedor

# accountsReceivable_table_header_description
source: Description
es: Descripción
pt: Descrição

# accountsReceivable_table_header_type
source: Type
es: Tipo
pt: Tipo

# accountsReceivable_table_header_installments
source: No. of installments
es: Nº de cuotas
pt: Nro. parcelas

# accountsReceivable_table_header_received
source: Received
es: Recibido
pt: Recebido

# accountsReceivable_table_header_pending
source: Pending
es: Pendiente
pt: Pendente

# accountsReceivable_table_header_total
source: Total receivable
es: Total a recibir
pt: Total a receber

# accountsReceivable_table_header_status
source: Status
es: Estado

# accountsReceivable_table_action_view
source: View
es: Ver
pt: Visualizar

# accountsReceivable_register_title
source: Register account receivable
es: Registro de cuenta por cobrar
pt: Registro de contas a receber

# accountsReceivable_view_title
source: Account receivable detail
es: Detalle de la cuenta por cobrar
pt: Detalhe da conta a receber

# accountsReceivable_form_field_financial_concept
source: Financial concept
es: Concepto financiero
pt: Conceito financeiro

# accountsReceivable_form_field_debtor_dni
source: Debtor tax ID
es: CIF/NIF del deudor
pt: CNPJ/CPJ do devedor

# accountsReceivable_form_field_debtor_phone
source: Debtor phone
es: Teléfono del deudor
pt: Telefone do devedor

# accountsReceivable_form_field_debtor_name
source: Debtor name
es: Nombre del deudor
pt: Nome do devedor

# accountsReceivable_form_field_debtor_email
source: Debtor email
es: Correo del deudor
pt: E-mail do devedor

# accountsReceivable_form_field_debtor_address
source: Debtor address
es: Dirección del deudor
pt: Endereço do devedor

# accountsReceivable_form_field_member
source: Select member
es: Selecciona el miembro
pt: Selecione o membro

# accountsReceivable_form_field_single_due_date
source: Due date
es: Fecha de vencimiento
pt: Data de vencimento

# accountsReceivable_form_field_automatic_installments
source: Number of installments
es: Cantidad de cuotas
pt: Quantidade de parcelas

# accountsReceivable_form_field_automatic_amount
source: Amount per installment
es: Valor por cuota
pt: Valor por parcela

# accountsReceivable_form_error_member_required
source: Select a member
es: Selecciona un miembro
pt: Selecione um membro

# accountsReceivable_form_error_description_required
source: Description is required
es: La descripción es obligatoria
pt: Descrição é obrigatória

# accountsReceivable_form_error_financial_concept_required
source: Select a financial concept
es: Selecciona un concepto financiero
pt: Selecione um conceito financeiro

# accountsReceivable_form_error_debtor_name_required
source: Debtor name is required
es: El nombre del deudor es obligatorio
pt: Nome do devedor é obrigatório

# accountsReceivable_form_error_debtor_dni_required
source: Debtor identifier is required
es: El identificador del deudor es obligatorio
pt: Identificador do devedor é obrigatório

# accountsReceivable_form_error_debtor_phone_required
source: Debtor phone is required
es: El teléfono del deudor es obligatorio
pt: Telefone do devedor é obrigatório

# accountsReceivable_form_error_debtor_email_required
source: Debtor email is required
es: El correo del deudor es obligatorio
pt: E-mail do devedor é obrigatório

# accountsReceivable_form_error_total_amount_required
source: Enter the total amount
es: Introduce el valor total
pt: Informe o valor total

# accountsReceivable_form_error_single_due_date_required
source: Enter the due date
es: Introduce la fecha de vencimiento
pt: Informe a data de vencimento

# accountsReceivable_form_error_installments_required
source: Generate the installments to continue
es: Genera las cuotas para continuar
pt: Gere as parcelas para continuar

# accountsReceivable_form_error_installments_invalid
source: Fill in amount and due date for each installment
es: Rellena importe y vencimiento de cada cuota
pt: Preencha valor e vencimento de cada parcela

# accountsReceivable_form_error_automatic_installments_required
source: Enter the number of installments
es: Introduce la cantidad de cuotas
pt: Informe a quantidade de parcelas

# accountsReceivable_form_error_automatic_amount_required
source: Enter the amount per installment
es: Introduce el valor por cuota
pt: Informe o valor por parcela

# accountsReceivable_form_error_automatic_first_due_date_required
source: Enter the date of the first installment
es: Introduce la fecha de la primera cuota
pt: Informe a data da primeira parcela

# accountsReceivable_form_error_installments_count_mismatch
source: The number of generated installments must match the total informed
es: La cantidad de cuotas generadas debe corresponder al total informado
pt: A quantidade de parcelas geradas deve corresponder ao total informado

# accountsReceivable_form_debtor_type_title
source: Debtor type
es: Tipo de deudor
pt: Tipo de devedor

# accountsReceivable_form_debtor_type_member
source: Church member
es: Miembro de la iglesia
pt: Membro da igreja

# accountsReceivable_form_debtor_type_external
source: External
es: Externo
pt: Externo

# accountsReceivable_form_installments_single_empty_message
source: Enter the amount and due date to see the summary.
es: Introduce el valor y la fecha de vencimiento para ver el resumen.
pt: Informe o valor e a data de vencimento para visualizar o resumo.

# accountsReceivable_form_installments_automatic_empty_message
source: Enter the data and click "Generate installments" to see the schedule.
es: Introduce los datos y haz clic en "Generar cuotas" para ver el cronograma.
pt: Informe os dados e clique em "Gerar parcelas" para visualizar o cronograma.

# accountsReceivable_form_installments_summary_title
source: Installments summary
es: Resumen de cuotas
pt: Resumo das parcelas

# accountsReceivable_form_installment_item_title
source: Installment {index}
es: Cuota {index}
pt: Parcela {index}

# accountsReceivable_form_installment_item_due_date
source: Due date: {date}
es: Vencimiento: {date}
pt: Vencimento: {date}

# accountsReceivable_form_save
source: Save
es: Guardar
pt: Salvar

# accountsReceivable_form_toast_saved_success
source: Account receivable registered successfully
es: Cuenta por cobrar registrada con éxito
pt: Conta a receber registrada com sucesso!

# accountsReceivable_form_toast_saved_error
source: Error while registering account receivable
es: Error al registrar la cuenta por cobrar
pt: Erro ao registrar conta a receber

# accountsReceivable_view_debtor_section
source: Debtor information
es: Información del deudor
pt: Informações do devedor

# accountsReceivable_view_debtor_name
source: Name
es: Nombre
pt: Nome

# accountsReceivable_view_debtor_dni
source: Tax ID
es: CIF/NIF
pt: CPF/CNPJ

# accountsReceivable_view_debtor_type
source: Debtor type
es: Tipo de deudor
pt: Tipo de devedor

# accountsReceivable_view_installments_title
source: Installments list
es: Listado de cuotas
pt: Listagem de parcelas

# accountsReceivable_view_register_payment
source: Register payment
es: Registrar pago
pt: Registrar pagamento

# accountsReceivable_view_general_section
source: General information
es: Información general
pt: Informações gerais

# accountsReceivable_view_general_created
source: Created
es: Creado
pt: Criado

# accountsReceivable_view_general_updated
source: Updated
es: Actualizado
pt: Atualizado

# accountsReceivable_view_general_description
source: Description
es: Descripción
pt: Descrição

# accountsReceivable_view_general_type
source: Type
es: Tipo
pt: Tipo

# accountsReceivable_view_general_total
source: Total amount
es: Importe total
pt: Valor total

# accountsReceivable_view_general_paid
source: Amount paid
es: Importe pagado
pt: Valor pago

# accountsReceivable_view_general_pending
source: Amount pending
es: Importe pendiente
pt: Valor pendente

# accountsReceivable_payment_total_label
source: Total amount to be paid
es: Importe total que debe pagarse
pt: Valor total que deve ser pago

# accountsReceivable_payment_submit
source: Submit payment
es: Enviar pago
pt: Enviar pagamento

# accountsReceivable_payment_receipt_label
source: Transfer receipt
es: Comprobante de la transferencia
pt: Comprovante da transferência

# accountsReceivable_payment_availability_account_label
source: Availability account
es: Cuenta de disponibilidad
pt: Conta de disponibilidade

# accountsReceivable_payment_amount_label
source: Payment amount
es: Importe del pago
pt: Valor do pagamento

# accountsReceivable_payment_toast_success
source: Payment registered successfully
es: Pago registrado con éxito
pt: Pagamento registrado com sucesso

# accountsReceivable_payment_error_amount_required
source: Enter the payment amount
es: Introduce el importe del pago
pt: Informe o valor do pagamento

# accountsReceivable_payment_error_availability_account_required
source: Select an availability account
es: Selecciona una cuenta de disponibilidad
pt: Selecione uma conta de disponibilidade

# accountsReceivable_form_field_automatic_first_due_date
source: First installment date
es: Primer vencimiento
pt: Primeiro vencimento

# accountsReceivable_form_generate_installments
source: Generate installments
es: Generar cuotas
pt: Gerar parcelas

# accountsReceivable_form_error_generate_installments_fill_data
source: Fill in the data to generate the installments.
es: Completa los datos para generar las cuotas.
pt: Preencha os dados para gerar as parcelas.

# accountsReceivable_form_toast_generate_installments_success
source: Installments generated automatically.
es: Cuotas generadas automáticamente.
pt: Parcelas geradas automaticamente.

# reports_income_download_pdf
source: Download PDF
es: Descargar PDF
pt: Baixar PDF

# reports_income_download_success
source: PDF downloaded successfully
es: PDF descargado con éxito
pt: PDF baixado com sucesso

# reports_income_download_error
source: Could not download the PDF
es: No fue posible descargar el PDF
pt: Não foi possível baixar o PDF

# reports_income_download_error_generic
source: Error while downloading the PDF
es: Error al descargar el PDF
pt: Erro ao baixar o PDF

# reports_dre_download_pdf
source: Download PDF
es: Descargar PDF
pt: Baixar PDF

# reports_dre_download_success
source: PDF downloaded successfully
es: PDF descargado con éxito
pt: PDF baixado com sucesso

# reports_dre_download_error
source: Could not download the PDF
es: No fue posible descargar el PDF
pt: Não foi possível baixar o PDF

# reports_dre_download_error_generic
source: Error while downloading the PDF
es: Error al descargar el PDF
pt: Erro ao baixar o PDF

# reports_income_breakdown_title
source: Income and expenses by category
es: Ingresos y gastos por categoría
pt: Receitas e despesas por categoria

# reports_income_breakdown_empty
source: No income and expense data for the selected period.
es: No hay datos de ingresos y gastos para el período.
pt: Não há dados de receita e despesa para o período.

# reports_income_breakdown_header_category
source: Category
es: Categoría
pt: Categoria

# reports_income_breakdown_header_income
source: Income
es: Entradas
pt: Entradas

# reports_income_breakdown_header_expenses
source: Expenses
es: Salidas
pt: Saídas

# reports_income_breakdown_header_balance
source: Balance
es: Saldo
pt: Saldo

# reports_income_cashflow_title
source: Cash flow by availability account
es: Flujo de caja por cuenta de disponibilidad
pt: Fluxo de caixa por conta de disponibilidade

# reports_income_cashflow_summary
source: Total income: {income} | Total expenses: {expenses} | Consolidated balance: {total}
es: Entradas totales: {income} | Salidas totales: {expenses} | Saldo consolidado: {total}
pt: Entradas totais: {income} | Saídas totais: {expenses} | Saldo consolidado: {total}

# reports_income_cashflow_empty
source: No availability account movements in this period.
es: No hay movimientos en cuentas de disponibilidad en este período.
pt: Nenhuma movimentação de contas de disponibilidade neste período.

# reports_income_cashflow_header_account
source: Account
es: Cuenta
pt: Conta

# reports_income_cashflow_header_income
source: Income
es: Entradas
pt: Entradas

# reports_income_cashflow_header_expenses
source: Expenses
es: Salidas
pt: Saídas

# reports_income_cashflow_header_balance
source: Period balance
es: Saldo del período
pt: Saldo do período

# reports_income_cost_centers_title
source: Cost center usage
es: Uso de centros de costo
pt: Uso dos centros de custo

# reports_income_cost_centers_total_applied
source: Total applied: {total}
es: Total aplicado: {total}
pt: Total aplicado: {total}

# reports_income_cost_centers_empty
source: No cost centers with movements in this period.
es: Ningún centro de costo con movimientos en este período.
pt: Nenhum centro de custo movimentado neste período.

# reports_income_cost_centers_header_name
source: Cost center
es: Centro de costo
pt: Centro de custo

# reports_income_cost_centers_header_total
source: Total applied
es: Total aplicado
pt: Total aplicado

# reports_income_cost_centers_header_last_move
source: Last movement
es: Último movimiento
pt: Último movimento

# reports_dre_screen_title
source: DRE - Statement of Income for the Year
es: DRE - Estado de Resultados del Ejercicio
pt: DRE - Demonstração do Resultado do Exercício

# reports_dre_header_title
source: Statement of Income for the Year
es: Estado de Resultados del Ejercicio
pt: Demonstração do Resultado do Exercício

# reports_dre_header_subtitle
source: Understand how your church received and used resources in the period
es: Entiende cómo tu iglesia recibió y utilizó los recursos en el período
pt: Entenda como sua igreja recebeu e utilizou os recursos no período

# reports_dre_footer_note
source: Note: This report considers only confirmed and reconciled entries that affect the accounting result.
es: Nota: Este informe considera solo los registros confirmados y conciliados que afectan el resultado contable.
pt: Nota: Este relatório considera apenas lançamentos confirmados e reconciliados que afetam o resultado contábil.

# reports_dre_main_indicators_title
source: Key indicators
es: Indicadores principales
pt: Indicadores principais

# reports_dre_card_gross_revenue_title
source: Gross revenue
es: Ingresos brutos
pt: Receita bruta

# reports_dre_card_gross_revenue_description
source: Total tithes, offerings and donations received
es: Total de diezmos, ofrendas y donaciones recibidas
pt: Total de dízimos, ofertas e doações recebidas

# reports_dre_card_operational_result_title
source: Operating result
es: Resultado operativo
pt: Resultado operacional

# reports_dre_card_operational_result_description
source: Gross result minus operating expenses
es: Resultado bruto menos gastos operativos
pt: Resultado bruto menos despesas operacionais

# reports_dre_card_net_result_title
source: Net result
es: Resultado neto
pt: Resultado líquido
