Repository: gloriafinance/gloria_finance_front
Catalog: lib/l10n/app_*.arb
Languages: es, pt

# reports_dre_card_net_result_description
source: Final result for the period (surplus or deficit)
es: Resultado final del período (superávit o déficit)
pt: Resultado final do período (superávit ou déficit)

# reports_dre_detail_section_title
source: Detail
es: Detalle
pt: Detalhamento

# reports_dre_item_net_revenue_title
source: Net revenue
es: Ingresos netos
pt: Receita líquida

# reports_dre_item_net_revenue_description
source: Gross revenue minus returns and adjustments
es: Ingresos brutos menos devoluciones y ajustes
pt: Receita bruta menos devoluções e ajustes

# reports_dre_item_direct_costs_title
source: Direct costs
es: Costos directos
pt: Custos diretos

# reports_dre_item_direct_costs_description
source: Event costs, materials and specific activities
es: Gastos de eventos, materiales y actividades específicas
pt: Gastos de eventos, materiais e atividades específicas

# reports_dre_item_gross_profit_title
source: Gross profit
es: Resultado bruto
pt: Resultado bruto

# reports_dre_item_gross_profit_description
source: Net revenue minus direct costs
es: Ingresos netos menos costos directos
pt: Receita líquida menos custos diretos

# reports_dre_item_operational_expenses_title
source: Operating expenses
es: Gastos operativos
pt: Despesas operacionais

# reports_dre_item_operational_expenses_description
source: Day-to-day expenses: electricity, water, salaries, cleaning
es: Gastos del día a día: energía, agua, salarios, limpieza
pt: Gastos do dia a dia: energia, água, salários, limpeza

# reports_dre_item_ministry_transfers_title
source: Ministry transfers
es: Transferencias ministeriales
pt: Repasses ministeriais

# reports_dre_item_ministry_transfers_description
source: Transfers to ministries, missions or to the board
es: Transferencias a ministerios, misiones o a la directiva
pt: Transferências para ministérios, missões ou para a diretoria

# trends_header_title
source: Composition of income, expenses and result
es: Composición de ingresos, gastos y resultado
pt: Composição de Receitas, Despesas e Resultado

# trends_header_comparison
source: Comparison: {currentMonthYear} vs {previousMonthYear}
es: Comparativo: {currentMonthYear} vs {previousMonthYear}
pt: Comparativo: {currentMonthYear} vs {previousMonthYear}

# trends_list_revenue
source: Revenue
es: Ingresos
pt: Receita

# trends_list_opex
source: Operating expenses
es: Gastos operativos
pt: Despesas operacionais

# trends_list_transfers
source: Ministry transfers
es: Transferencias ministeriales
pt: Repasses ministeriais

# trends_list_capex
source: Investments
es: Inversiones
pt: Investimentos

# trends_list_net_income
source: Net result
es: Resultado neto
pt: Resultado líquido

# trends_summary_revenue
source: Revenue
es: Ingresos
pt: Receita

# trends_summary_opex
source: Operating
es: Operativos
pt: Operacionais

# trends_summary_transfers
source: Transfers
es: Transferencias
pt: Repasses

# trends_summary_capex
source: Investments
es: Inversiones
pt: Investimentos

# trends_summary_net_income
source: Result
es: Resultado
pt: Resultado

# reports_monthly_tithes_title
source: Monthly tithes report
es: Informe de diezmos mensuales
pt: Relatório de dízimos mensais

# reports_monthly_tithes_empty
source: No monthly tithes to show
es: No hay diezmos mensuales para mostrar
pt: Não há dízimos mensais para mostrar

# reports_monthly_tithes_header_date
source: Date
es: Fecha
pt: Data

# reports_monthly_tithes_header_amount
source: Amount
es: Importe
pt: Valor

# reports_monthly_tithes_header_account
source: Availability account
es: Cuenta de disponibilidad
pt: Conta de disponibilidade

# reports_monthly_tithes_header_account_type
source: Account type
es: Tipo de cuenta
pt: Tipo de conta

# finance_records_filter_concept_type
source: Concept type
es: Tipo de concepto
pt: Tipo de conceito

# finance_records_filter_concept
source: Concept
es: Concepto
pt: Conceito

# finance_records_filter_availability_account
source: Availability account
es: Cuenta de disponibilidad
pt: Conta de disponibilidade

# finance_records_table_empty
source: No financial records to show
es: No hay datos financieros para mostrar
pt: Não há dados financeiros para mostrar

# finance_records_table_header_date
source: Date
es: Fecha
pt: Data

# finance_records_table_header_amount
source: Amount
es: Importe
pt: Valor

# finance_records_table_header_type
source: Movement type
es: Tipo de movimiento
pt: Tipo de movimento

# finance_records_table_header_concept
source: Concept
es: Concepto
pt: Conceito

# finance_records_table_header_availability_account
source: Availability account
es: Cuenta de disponibilidad
pt: Conta de disponibilidade

# finance_records_table_header_status
source: Status
es: Estado

# finance_records_table_action_void
source: Void
es: Anular
pt: Anular

# finance_records_table_confirm_void
source: Do you want to void this financial movement?
es: ¿Deseas anular este movimiento financiero?
pt: Deseja anular este movimento financeiro?

# finance_records_table_modal_title
source: Financial movement
es: Movimiento financiero
pt: Movimento financeiro

# finance_records_form_title
source: Financial record
es: Registro financiero
pt: Registro financeiro

# finance_records_form_field_description
source: Description
es: Descripción
pt: Descrição

# finance_records_form_field_date
source: Date
es: Fecha
pt: Data

# finance_records_form_field_receipt
source: Bank movement receipt
es: Comprobante del movimiento bancario
pt: Comprovante do movimento bancário

# finance_records_form_field_cost_center
source: Cost center
es: Centro de costo
pt: Centro de custo

# finance_records_form_save
source: Save
es: Guardar
pt: Salvar

# finance_records_form_toast_purchase_in_construction
source: Purchase records are under construction
es: Registro de compras en construcción
pt: Registro de compras em construção

# finance_records_form_toast_saved_success
source: Record saved successfully
es: Registro guardado con éxito
pt: Registro salvo com sucesso

# common_view
source: View
es: Ver
pt: Visualizar

# contributions_status_processed
source: Processed
es: Procesada
pt: Processada

# contributions_status_pending_verification
source: Pending verification
es: Pendiente de verificación
pt: Verificação pendente

# contributions_status_rejected
source: Rejected
es: Rechazada
pt: Rejeitada

# accountsPayable_list_title
source: Accounts payable
es: Cuentas por pagar
pt: Contas a pagar

# accountsPayable_list_new
source: Register accounts payable
es: Registrar cuentas por pagar
pt: Registrar Contas a pagar

# accountsPayable_table_empty
source: No accounts payable to show
es: No hay cuentas por pagar para mostrar
pt: Nāo ha contas a pagar para mostrar

# accountsPayable_table_header_supplier
source: Supplier
es: Proveedor
pt: Fornecedor

# accountsPayable_table_header_description
source: Description
es: Descripción
pt: Descricao

# accountsPayable_table_header_installments
source: No. of installments
es: Nº de cuotas
pt: Nro. parcelas

# accountsPayable_table_header_paid
source: Paid
es: Pagado
pt: Pago

# accountsPayable_table_header_pending
source: Pending
es: Pendiente
pt: Pendente

# accountsPayable_table_header_total
source: Total payable
es: Total a pagar
pt: Total a pagar

# accountsPayable_table_header_status
source: Status
es: Estado

# accountsPayable_table_action_view
source: View
es: Ver
pt: Visualizar

# accountsPayable_register_title
source: Register account payable
es: Registrar cuenta por pagar
pt: Registrar Conta a Pagar

# accountsPayable_view_title
source: Accounts payable detail
es: Detalle de la cuenta por pagar
pt: Detalhe da Contas a pagar

# accountsPayable_view_installments_title
source: Installments list
es: Listado de cuotas
pt: Listagem de Parcelas

# accountsPayable_view_register_payment
source: Register payment
es: Registrar pago
pt: Registrar Pagamento

# accountsPayable_view_provider_section
source: Supplier information
es: Información del proveedor
pt: Informações do Fornecedor

# accountsPayable_view_provider_name
source: Name
es: Nombre
pt: Nome

# accountsPayable_view_provider_dni
source: Tax ID
es: CIF/NIF
pt: CNPJ/CPF

# accountsPayable_view_provider_phone
source: Phone
es: Teléfono

# accountsPayable_view_provider_email
source: Email
es: Correo electrónico

# accountsPayable_view_provider_type
source: Supplier type
es: Tipo de proveedor
pt: Tipo de fornecedor

# accountsPayable_view_general_section
source: General information
es: Información general
pt: Informações Gerais

# accountsPayable_view_general_created
source: Created
es: Creado
pt: Criado

# accountsPayable_view_general_updated
source: Updated
es: Actualizado
pt: Atualizado

# accountsPayable_view_general_description
source: Description
es: Descripción
pt: Descrição

# accountsPayable_view_general_total
source: Total amount
es: Importe total
pt: Valor Total

# accountsPayable_view_general_paid
source: Amount paid
es: Importe pagado
pt: Valor Pago

# accountsPayable_view_general_pending
source: Amount pending
es: Importe pendiente
pt: Valor Pendente

# accountsPayable_payment_total_label
source: Total amount to be paid
es: Importe total que debe pagarse
pt: Valor total que deve ser pago

# accountsPayable_payment_submit
source: Submit payment
es: Enviar pago
pt: Enviar Pagamento

# accountsPayable_payment_receipt_label
source: Transfer receipt
es: Comprobante de la transferencia
pt: Comprovante da transferência

# accountsPayable_payment_cost_center_label
source: Cost center
es: Centro de costo
pt: Centro de custo

# accountsPayable_payment_availability_account_label
source: Availability account
es: Cuenta de disponibilidad
pt: Conta de disponibilidade

# accountsPayable_payment_amount_label
source: Payment amount
es: Importe del pago
pt: Valor do Pagamento

# accountsPayable_payment_toast_success
source: Payment registered successfully
es: Pago registrado con éxito
pt: Pagamento registrado com sucesso

# accountsPayable_form_section_basic_title
source: Basic information
es: Información básica
pt: Informações básicas

# accountsPayable_form_section_basic_subtitle
source: Choose the supplier and describe the account payable.
es: Elige el proveedor y describe la cuenta por pagar.
pt: Escolha o fornecedor e descreva a conta a pagar.

# accountsPayable_form_section_document_title
source: Fiscal document
es: Documento fiscal
pt: Documento fiscal

# accountsPayable_form_section_document_subtitle
source: Provide the fiscal document associated with the payment.
es: Indica el documento fiscal asociado al pago.
pt: Informe o documento fiscal associado ao pagamento.

# accountsPayable_form_section_tax_title
source: Invoice taxation
es: Tributación de la factura
pt: Tributação da nota fiscal

# accountsPayable_form_section_tax_subtitle
source: Classify the invoice and enter the highlighted taxes.
es: Clasifica la factura e indica los impuestos destacados.
pt: Classifique a nota e informe os impostos destacados.

# accountsPayable_form_section_payment_title
source: Payment configuration
es: Configuración del pago
pt: Configuração do pagamento

# accountsPayable_form_section_payment_subtitle
source: Define how this account will be settled and review the installments schedule.
es: Define cómo se cancelará esta cuenta y revisa el cronograma de cuotas.
pt: Defina como essa conta será quitada e revise o cronograma de parcelas.

# accountsPayable_form_field_supplier
source: Supplier
es: Proveedor
pt: Fornecedor

# accountsPayable_form_field_description
source: Description
es: Descripción
pt: Descrição

# accountsPayable_form_field_document_type
source: Document type
es: Tipo de documento
pt: Tipo de documento

# accountsPayable_form_field_document_number
source: Document number
es: Número del documento
pt: Número do documento

# accountsPayable_form_field_document_date
source: Document date
es: Fecha del documento
pt: Data do documento

# accountsPayable_form_field_tax_exempt_switch
source: Invoice exempt from taxes
es: Factura exenta de impuestos
pt: Nota fiscal isenta de impostos

# accountsPayable_form_field_tax_exemption_reason
source: Exemption reason
es: Motivo de la exención
pt: Motivo da isenção

# accountsPayable_form_field_tax_observation
source: Observations
es: Observaciones
pt: Observações

# accountsPayable_form_field_tax_cst
source: CST code
es: Código CST
pt: Código CST

# accountsPayable_form_section_payment_mode_help_cst
source: Quick help about CST
es: Ayuda rápida sobre CST
pt: Ajuda rápida sobre CST

# accountsPayable_form_section_payment_mode_help_cfop
source: Quick help about CFOP
es: Ayuda rápida sobre CFOP
pt: Ajuda rápida sobre CFOP

# accountsPayable_form_error_supplier_required
source: Supplier is required
es: El proveedor es obligatorio
pt: O fornecedor é obrigatório

# accountsPayable_form_error_description_required
source: Description is required
es: La descripción es obligatoria
pt: A descrição é obrigatória

# accountsPayable_form_error_document_type_required
source: Select the document type
es: Selecciona el tipo de documento
pt: Selecione o tipo de documento

# accountsPayable_form_error_document_number_required
source: Enter the document number
es: Introduce el número del documento
pt: Informe o número do documento

# accountsPayable_form_error_document_date_required
source: Enter the document date
es: Introduce la fecha del documento
pt: Informe a data do documento

# accountsPayable_form_error_total_amount_required
source: Enter an amount greater than zero
es: Introduce un importe mayor que cero
pt: Informe um valor maior que zero

# accountsPayable_form_error_single_due_date_required
source: Enter the due date
es: Introduce la fecha de vencimiento
pt: Informe a data de vencimento

# accountsPayable_form_error_installments_required
source: Generate or add at least one installment
es: Genera o añade al menos una cuota
pt: Gere ou adicione ao menos uma parcela

# accountsPayable_form_error_installments_contents
source: Fill in amount and due date for each installment
es: Rellena importe y vencimiento de cada cuota
pt: Preencha valor e vencimento de cada parcela

# accountsPayable_form_error_automatic_installments_required
source: Enter the number of installments
es: Introduce la cantidad de cuotas
pt: Informe a quantidade de parcelas

# accountsPayable_form_error_automatic_amount_required
source: Enter the amount per installment
es: Introduce el importe por cuota
pt: Informe o valor por parcela

# accountsPayable_form_error_automatic_first_due_date_required
source: Enter the date of the first installment
es: Introduce la fecha de la primera cuota
pt: Informe a data da primeira parcela

# accountsPayable_form_error_installments_count_mismatch
source: The number of generated installments must match the total informed
es: La cantidad de cuotas generadas debe corresponder al total informado
pt: A quantidade de parcelas geradas deve corresponder ao total informado

# accountsPayable_form_error_taxes_required
source: Add withheld taxes when the invoice is not exempt
es: Añade los impuestos retenidos cuando la factura no sea exenta
pt: Adicione os impostos retidos quando a nota não for isenta

# accountsPayable_form_error_taxes_invalid
source: Enter type, percentage and amount for each tax
es: Indica tipo, porcentaje e importe para cada impuesto
pt: Informe tipo, percentual e valor para cada imposto

# accountsPayable_form_error_tax_exemption_reason_required
source: Enter the invoice exemption reason
es: Indica el motivo de la exención de la factura
pt: Informe o motivo da isenção da nota fiscal

# accountsPayable_form_error_installments_add_one
source: Add at least one installment
es: Añade al menos una cuota
pt: Adicione pelo menos uma parcela

# accountsPayable_form_error_tax_exempt_must_not_have_taxes
source: Exempt invoices must not have withheld taxes
es: Las facturas exentas no deben tener impuestos retenidos
pt: Notas isentas não devem possuir impostos retidos

# accountsPayable_form_error_tax_status_mismatch
source: Update the tax status according to the highlighted taxes
es: Actualiza la situación tributaria según los impuestos destacados
pt: Atualize a situação tributária conforme os impostos destacados

# accountsPayable_form_installments_single_empty_message
source: Enter the amount and due date to see the summary.
es: Introduce el valor y la fecha de vencimiento para ver el resumen.
pt: Informe o valor e a data de vencimento para visualizar o resumo.

# accountsPayable_form_installments_automatic_empty_message
source: Enter the data and click "Generate installments" to see the schedule.
es: Introduce los datos y haz clic en "Generar cuotas" para ver el cronograma.
pt: Informe os dados e clique em "Gerar parcelas" para visualizar o cronograma.

# accountsPayable_form_field_total_amount
source: Total amount
es: Valor total
pt: Valor total

# accountsPayable_form_field_single_due_date
source: Due date
es: Fecha de vencimiento
pt: Data de vencimento

# accountsPayable_form_field_automatic_installments
source: Number of installments
es: Cantidad de cuotas
pt: Quantidade de parcelas

# accountsPayable_form_field_automatic_amount
source: Amount per installment
es: Valor por cuota
pt: Valor por parcela

# accountsPayable_form_field_automatic_first_due_date
source: First installment date
es: Primer vencimiento
pt: Primeiro vencimento

# accountsPayable_form_generate_installments
source: Generate installments
es: Generar cuotas
pt: Gerar parcelas

# accountsPayable_form_error_generate_installments_fill_data
source: Fill in the data to generate the installments.
es: Completa los datos para generar las cuotas.
pt: Preencha os dados para gerar as parcelas.

# accountsPayable_form_toast_generate_installments_success
source: Installments generated successfully.
es: Cuotas generadas con éxito.
pt: Parcelas geradas com sucesso.

# accountsPayable_form_installments_summary_title
source: Installments summary
es: Resumen de cuotas
pt: Resumo das parcelas

# accountsPayable_form_installment_item_title
source: Installment {index}
es: Cuota {index}
pt: Parcela {index}

# accountsPayable_form_installment_item_due_date
source: Due date: {date}
es: Vencimiento: {date}
pt: Vencimento: {date}

# accountsPayable_form_toast_saved_success
source: Account payable registered successfully
es: Cuenta por pagar registrada con éxito
pt: Conta a pagar registrada com sucesso!

# accountsPayable_form_toast_saved_error
source: Error while registering account payable
es: Error al registrar la cuenta por pagar
pt: Erro ao registrar conta a pagar

# accountsPayable_form_save
source: Save
es: Guardar
pt: Salvar

# contributions_list_title
source: Contributions list
es: Lista de contribuciones
pt: Lista de contribuições

# contributions_list_new
source: Register contribution
es: Registrar contribución
pt: Registrar contribuição

# contributions_table_empty
source: No contributions found
es: No se encontró ninguna contribución
pt: Nenhuma contribuição encontrada

# contributions_table_header_member
source: Name
es: Nombre
pt: Nome

# contributions_table_header_amount
source: Amount
es: Importe
pt: Valor

# contributions_table_header_type
source: Contribution type
es: Tipo de contribución
pt: Tipo de contribuição

# contributions_table_header_status
source: Status
es: Estado

# contributions_table_header_date
source: Date
es: Fecha
pt: Data

# contributions_table_modal_title
source: Contribution #{id}
es: Contribución #{id}
pt: Contribuição #{id}

# contributions_view_field_amount
source: Amount
es: Importe
pt: Valor

# contributions_view_field_status
source: Status
es: Estado

# contributions_view_field_date
source: Date
es: Fecha
pt: Data

# contributions_view_field_account
source: Account
es: Cuenta
pt: Conta

# contributions_view_section_member
source: Member
es: Miembro
pt: Membro

# contributions_view_section_financial_concept
source: Financial concept
es: Concepto financiero
pt: Conceito financeiro

# contributions_view_section_receipt
source: Transfer receipt
es: Comprobante de la transferencia
pt: Comprovante da transferência

# contributions_view_action_approve
source: Approve
es: Aprobar
pt: Aprovar

# contributions_view_action_reject
source: Reject
es: Rechazar
pt: Rejeitar

# accountsReceivable_form_section_payment_title
source: Payment configuration
es: Configuración del cobro
pt: Configuração do recebimento

# accountsReceivable_form_section_payment_subtitle
source: Define how this receivable will be charged and review the installments schedule.
es: Define cómo se cobrará esta cuenta y revisa el cronograma de cuotas.
pt: Defina como essa conta será cobrada e revise o cronograma de parcelas.

# accountsReceivable_form_field_type
source: Account type
es: Tipo de cuenta
pt: Tipo de conta

# accountsReceivable_type_help_title
source: How to classify the account type
es: Cómo clasificar el tipo de cuenta
pt: Como classificar o tipo da conta

# accountsReceivable_type_help_intro
source: Choose the type that best describes the origin of the receivable amount.
es: Elige el tipo que mejor describe el origen del valor a cobrar.
pt: Escolha o tipo que melhor descreve a origem do valor a receber.

# accountsReceivable_type_contribution_title
source: Contribution
es: Contribución
pt: Contribuição

# accountsReceivable_type_contribution_description
source: Voluntary commitments made by members or groups.
es: Compromisos voluntarios asumidos por miembros o grupos.
pt: Compromissos voluntários assumidos por membros ou grupos.

# accountsReceivable_type_contribution_example
source: E.g.: missions campaigns, recurring offerings, special donations.
es: Ej.: campañas de misiones, ofrendas recurrentes, donaciones especiales.
pt: Ex.: campanhas de missões, ofertas recorrentes, doações especiais.

# accountsReceivable_type_service_title
source: Service
es: Servicio
pt: Serviço

# accountsReceivable_type_service_description
source: Charges for activities or services provided by the church.
es: Cobros por actividades o servicios prestados por la iglesia.
pt: Cobranças por atividades ou serviços prestados pela igreja.

# accountsReceivable_type_service_example
source: E.g.: music courses, conferences, event catering rental.
es: Ej.: cursos de música, conferencias, alquiler de buffet del evento.
pt: Ex.: cursos de música, conferências, aluguel de buffet do evento.

# accountsReceivable_type_interinstitutional_title
source: Interinstitutional
es: Interinstitucional
pt: Interinstitucional

# accountsReceivable_type_interinstitutional_description
source: Amounts arising from partnerships with other institutions.
es: Valores derivados de asociaciones con otras instituciones.
pt: Valores decorrentes de parcerias com outras instituições.

# accountsReceivable_type_interinstitutional_example
source: E.g.: support for joint events, agreements with another church.
es: Ej.: apoyo en eventos conjuntos, convenios con otra iglesia.
pt: Ex.: apoio em eventos conjuntos, convênios com outra igreja.

# accountsReceivable_type_rental_title
source: Rental
es: Alquiler
pt: Locação

# accountsReceivable_type_rental_description
source: Paid use of spaces, vehicles or equipment.
es: Préstamo remunerado de espacios, vehículos o equipos.
pt: Empréstimo remunerado de espaços, veículos ou equipamentos.

# accountsReceivable_type_rental_example
source: E.g.: auditorium rental, instruments or chair rental.
es: Ej.: alquiler del auditorio, alquiler de instrumentos o sillas.
pt: Ex.: aluguel do auditório, locação de instrumentos ou cadeiras.

# accountsReceivable_type_loan_title
source: Loan
es: Préstamo
pt: Empréstimo

# accountsReceivable_type_loan_description
source: Resources granted by the church that must be repaid.
es: Recursos concedidos por la iglesia que deben devolverse.
pt: Recursos concedidos pela igreja que devem ser devolvidos.
