Repository: gloriafinance/gloria_finance_front
Catalog: lib/l10n/app_*.arb
Languages: es, pt

# accountsReceivable_type_loan_example
source: E.g.: advances to ministries, temporary financial support.
es: Ej.: adelantos a ministerios, apoyo financiero temporal.
pt: Ex.: adiantamento a ministérios, apoio financeiro temporário.

# accountsReceivable_type_financial_title
source: Financial
es: Financiero
pt: Financeiro

# accountsReceivable_type_financial_description
source: Bank movements that are still pending settlement.
es: Movimientos bancarios que aún están pendientes de compensación.
pt: Movimentos bancários que ainda aguardam compensação.

# accountsReceivable_type_financial_example
source: E.g.: checks in process, card acquiring, refunds.
es: Ej.: cheques en procesamiento, adquirencia de tarjeta, devoluciones.
pt: Ex.: cheques em processamento, adquirência de cartão, devoluções.

# accountsReceivable_type_legal_title
source: Legal
es: Jurídico
pt: Jurídico

# accountsReceivable_type_legal_description
source: Charges related to legal actions, insurance or indemnities.
es: Cobros relacionados con acciones judiciales, seguros o indemnizaciones.
pt: Cobranças relacionadas a ações judiciais, seguros ou indenizações.

# accountsReceivable_type_legal_example
source: E.g.: enforcement of judgment, claims covered by insurer.
es: Ej.: cumplimiento de sentencia, siniestros cubiertos por aseguradora.
pt: Ex.: cumprimento de sentença, sinistros cobertos por seguradora.

# common_see_all
source: See all
es: Ver todos
pt: Ver todos

# member_home_placeholder
source: Member experience
es: Experiencia del miembro
pt: Experiência do membro

# member_home_upcoming_events_title
source: Upcoming events
es: Próximos eventos
pt: Próximos eventos

# member_home_upcoming_events_empty
source: No upcoming events in the next few days.
es: No hay próximos eventos en los próximos días.
pt: Nenhum evento nos próximos dias.

# member_schedule_detail_information_title
source: Information
es: Información
pt: Informações

# member_schedule_detail_details_title
source: Details
es: Detalles
pt: Detalhes

# member_schedule_detail_optional_label
source: (optional)
es: (opcional)
pt: (opcional)

# member_schedule_detail_no_extra_info
source: No additional details available.
es: No hay detalles adicionales disponibles.
pt: Nenhum detalhe adicional disponível.

# member_contribution_history_title
source: Contribution history
es: Historial de contribuciones
pt: Histórico de contribuições

# member_contribution_new_button
source: New contribution
es: Nueva contribución
pt: Nova contribuição

# member_contribution_filter_type_label
source: Type
es: Tipo
pt: Tipo

# member_contribution_filter_type_all
source: All
es: Todas
pt: Todas

# member_contribution_type_tithe
source: Tithe
es: Diezmo
pt: Dízimo

# member_contribution_type_offering
source: Offering
es: Ofrenda
pt: Oferta

# member_contribution_destination_label
source: Contribution destination
es: Destino de la contribución
pt: Destino da contribuição

# member_contribution_search_account_hint
source: Search account...
es: Buscar cuenta...
pt: Buscar conta...

# member_contribution_offering_concept_label
source: Offering
es: Ofrenda
pt: Oferta

# member_contribution_search_concept_hint
source: Search concept...
es: Buscar concepto...
pt: Buscar conceito...

# member_contribution_value_label
source: Contribution amount
es: Valor de la contribución
pt: Valor da contribuição

# member_contribution_amount_other
source: Other amount
es: Otro monto
pt: Outro valor

# member_contribution_receipt_label
source: Upload the payment receipt
es: Envía el comprobante del pago
pt: Envie o comprovante do pagamento

# member_contribution_receipt_payment_date_label
source: Payment date
es: Fecha del pago
pt: Data do pagamento

# member_contribution_receipt_help_text
source: Your church treasury will review this receipt. Attaching it is mandatory.
es: Tesorería de tu iglesia analizará este comprobante. Es obligatorio adjuntarlo.
pt: Esse comprovante será analisado pela tesouraria da sua igreja. É obrigatório anexar.

# member_contribution_message_label
source: Message (optional)
es: Mensaje (opcional)
pt: Mensagem (opcional)

# member_contribution_continue_button
source: Continue
es: Continuar
pt: Continuar

# member_contribution_payment_method_question
source: How do you want to record the payment?
es: ¿Cómo quieres registrar el pago?
pt: Como você quer registrar o pagamento?

# member_contribution_payment_method_boleto_title
source: Generate a boleto to pay later
es: Generar boleto para pagar después
pt: Gerar boleto para pagar depois

# member_contribution_payment_method_manual_title
source: I already contributed, I want to upload the receipt
es: Ya contribuí, quiero enviar el comprobante
pt: Já contribui, quero enviar o comprovante

# member_contribution_payment_method_pix_description
source: Pay now via PIX. Generate the QR code or copy-and-paste code to pay in your banking app.
es: Paga ahora vía PIX. Genera el código QR o copia y pega el código para pagar en tu banco.
pt: Pagar agora via PIX. Gere o QR Code ou o código copia e cola para pagar no app do seu banco.

# member_contribution_payment_method_boleto_description
source: Generate a boleto to pay later through online banking or your app.
es: Genera un boleto para pagar después en tu banca en línea o app.
pt: Gere um boleto para pagar depois no internet banking ou aplicativo.

# member_contribution_payment_method_manual_description
source: Deposit, transfer, or use another method, then upload the receipt here.
es: Deposita, transfiere o usa otro método. Luego, sube el comprobante aquí.
pt: Deposite, transfira ou use outro método. Depois, envie o comprovante aqui.

# member_contribution_history_empty_title
source: You do not have any contributions yet
es: Aún no tienes contribuciones
pt: Você ainda não possui contribuições

# member_contribution_history_empty_subtitle
source: Once you make a contribution, it will appear here.
es: Cuando realices una contribución, aparecerá aquí.
pt: Quando você realizar uma contribuição, ela aparecerá aqui.

# member_contribution_history_item_default_title
source: Contribution
es: Contribución
pt: Contribuição

# member_contribution_history_item_receipt_submitted
source: Receipt submitted
es: Comprobante enviado
pt: Comprovante enviado

# member_contribution_pix_title
source: Pay with PIX
es: Paga con PIX
pt: Pague com PIX

# member_contribution_pix_recipient
source: Recipient: {recipient}
es: Destinatario: {recipient}
pt: Destinatário: {recipient}

# member_contribution_pix_qr_hint
source: Scan this QR code in your banking app.
es: Escanea este código QR en la app de tu banco.
pt: Escaneie este QR Code no app do seu banco.

# member_contribution_pix_code_label
source: PIX copy and paste code
es: Código PIX copiar y pegar
pt: Código PIX copia e cola

# member_contribution_copy_code
source: Copy code
es: Copiar código
pt: Copiar código

# member_contribution_pix_footer
source: After paying, you can track the confirmation in your contribution history.
es: Después de realizar el pago, podrás seguir la confirmación en tu historial de contribuciones.
pt: Após realizar o pagamento, você poderá acompanhar a confirmação no seu histórico de contribuições.

# member_contribution_back_to_home
source: Back to home
es: Volver al inicio
pt: Voltar ao início

# member_contribution_pix_copy_success
source: PIX code copied!
es: ¡Código PIX copiado!
pt: Código PIX copiado!

# member_contribution_boleto_title
source: Pay with boleto
es: Paga con boleto
pt: Pague com boleto

# member_contribution_boleto_due_date_label
source: Due date:
es: Vencimiento:
pt: Vencimento:

# member_contribution_boleto_instruction
source: Use the code below to pay in your online banking or app.
es: Usa el código de abajo para pagar en tu banca en línea o app.
pt: Use o código abaixo para pagar no seu internet banking ou aplicativo.

# member_contribution_boleto_line_label
source: Digitable line
es: Línea digitável
pt: Linha digitável

# member_contribution_boleto_download_pdf
source: Download boleto PDF
es: Descargar boleto en PDF
pt: Baixar boleto em PDF

# member_contribution_boleto_footer
source: After paying, the confirmation will appear in your contribution history. Keep the receipt.
es: Después de pagar, la confirmación aparecerá en tu historial de contribuciones. Guarda el comprobante.
pt: Após realizar o pagamento, a confirmação aparecerá no seu histórico de contribuições. Guarde o comprovante.

# member_contribution_boleto_copy_success
source: Digitable line copied!
es: ¡Línea digitável copiada!
pt: Linha digitável copiada!

# member_contribution_boleto_pdf_error
source: Could not open the PDF
es: No fue posible abrir el PDF
pt: Não foi possível abrir o PDF

# member_contribution_result_success_title
source: Contribution completed successfully!
es: ¡Contribución realizada con éxito!
pt: Contribuição realizada com sucesso!

# member_contribution_result_success_subtitle
source: Thank you for your generosity.
es: Gracias por tu generosidad.
pt: Obrigado pela sua generosidade.

# member_contribution_result_date
source: Date: {date}
es: Fecha: {date}
pt: Data: {date}

# member_contribution_result_info
source: The treasury team will review your receipt.
es: Tesorería revisará tu comprobante.
pt: O seu comprovante será conferido pela tesouraria.

# member_contribution_view_history
source: View history
es: Ver historial
pt: Ver histórico

# member_contribution_result_error_title
source: We could not process the payment
es: No fue posible procesar el pago
pt: Não foi possível processar o pagamento

# member_contribution_result_error_message
source: Check the payment details or try another method.
es: Verifica los datos del pago o intenta con otro método.
pt: Verifique os dados do cartão ou tente outro método de pagamento.

# member_contribution_try_again
source: Try again
es: Intentar nuevamente
pt: Tentar novamente

# member_contribution_form_required_fields_error
source: Please fill in all required fields
es: Completa todos los campos obligatorios
pt: Por favor, preencha todos os campos obrigatórios

# member_contribution_form_receipt_required_error
source: The receipt is required.
es: El comprobante es obligatorio.
pt: O comprovante é obrigatório.

# member_contribution_form_submission_error
source: Error processing the contribution: {error}
es: Error al procesar la contribución: {error}
pt: Erro ao processar contribuição: {error}

# member_contribution_validator_amount_required
source: Enter the amount
es: Informe el valor
pt: Informe o valor

# member_contribution_validator_financial_concept_required
source: Select a financial concept
es: Selecciona un concepto financiero
pt: Selecione um conceito financeiro

# member_contribution_validator_account_required
source: Select the availability account
es: Selecciona la cuenta de disponibilidad
pt: Selecione a conta de disponibilidade

# member_contribution_validator_month_required
source: Select a month
es: Selecciona un mes
pt: Selecione um mês

# member_drawer_greeting
source: Example Member
es: Miembro de ejemplo
pt: Membro Exemplo

# member_drawer_view_profile
source: View my profile
es: Ver mi perfil
pt: Ver meu perfil

# member_drawer_notifications
source: Notifications
es: Notificaciones
pt: Notificações

# member_drawer_profile
source: My profile
es: Mi perfil
pt: Meu Perfil

# member_drawer_settings
source: Settings
es: Configuraciones
pt: Configurações

# member_drawer_privacy_policy
source: Privacy Policy
es: Política de privacidad
pt: Política de Privacidade

# member_drawer_sensitive_data
source: Sensitive Data Policy
es: Tratamiento de datos
pt: Tratamento de Dados

# member_drawer_terms
source: Terms of Use
es: Términos de uso
pt: Termos de Uso

# member_drawer_logout
source: Log out
es: Salir
pt: Sair

# member_drawer_version
source: Version {version}
es: Versión {version}
pt: Versão {version}

# member_shell_nav_home
source: Home
es: Inicio
pt: Início

# member_shell_nav_contribute
source: Contribute
es: Contribuir
pt: Contribuir

# member_shell_nav_commitments
source: Commitments
es: Compromisos
pt: Compromissos

# member_shell_nav_statements
source: Statements
es: Estados
pt: Extratos

# member_shell_header_tagline
source: CHURCH
es: IGLESIA
pt: IGREJA

# member_commitments_title
source: My commitments
es: Mis compromisos
pt: Meus compromissos

# member_commitments_empty_title
source: You don't have contribution commitments yet
es: Aún no tienes compromisos de contribución
pt: Você ainda não possui compromissos de contribuição

# member_commitments_empty_subtitle
source: When the treasury assigns one to you, it will appear here.
es: Cuando tesorería registre un compromiso para ti, aparecerá aquí.
pt: Quando a tesouraria registrar um compromisso para você, ele aparecerá aqui.

# member_commitments_total_label
source: Total amount
es: Valor total
pt: Valor total

# member_commitments_paid_label
source: Already contributed
es: Ya contribuido
pt: Já contribuído

# member_commitments_balance_label
source: Balance
es: Saldo
pt: Saldo

# member_commitments_progress_label
source: Completed
es: Completado
pt: Concluído

# member_commitments_button_view_details
source: View details & pay
es: Ver detalles y pagar
pt: Ver detalhes & pagar

# member_commitments_status_pending
source: In progress
es: En progreso
pt: Em andamento

# member_commitments_status_paid
source: Completed
es: Concluido
pt: Concluído

# member_commitments_status_pending_acceptance
source: Pending acceptance
es: Pendiente de aceptación
pt: Pendente de aceite

# member_commitments_status_denied
source: Denied
es: Rechazado
pt: Negado

# member_commitments_detail_title
source: Commitment details
es: Detalles del compromiso
pt: Detalhes do compromisso

# member_commitments_detail_subtitle
source: Track your progress and choose how to pay your installments.
es: Revisa el progreso y elige cómo pagar tus cuotas.
pt: Acompanhe o progresso e escolha como pagar suas parcelas.

# member_commitments_detail_next_installment
source: Next installment
es: Próxima cuota
pt: Próxima parcela

# member_profile_personal_data_title
source: Personal data
es: Datos personales
pt: Dados pessoais

# member_profile_security_title
source: Security
es: Seguridad
pt: Segurança

# member_profile_notifications_title
source: Notifications
es: Notificaciones
pt: Notificações

# member_profile_full_name_label
source: Full name
es: Nombre completo
pt: Nome completo

# member_profile_email_label
source: Email
es: Correo electrónico

# member_profile_phone_label
source: Phone
es: Teléfono
pt: Telefone

# member_profile_dni_label
source: ID/Tax ID
es: DNI/NIF
pt: CPF

# member_profile_member_since
source: Member since {date}
es: Miembro desde {date}
pt: Membro desde {date}

# member_profile_change_password_title
source: Change password
es: Cambiar contraseña
pt: Alterar senha

# member_profile_change_password_subtitle
source: Update your access password
es: Actualiza tu contraseña de acceso
pt: Atualize sua senha de acesso

# member_profile_notifications_settings_title
source: Notification settings
es: Configuración de notificaciones
pt: Configurações de notificações

# member_profile_notifications_settings_subtitle
source: Choose how you want to be notified by the church
es: Elige cómo deseas ser avisado por la iglesia
pt: Escolha como deseja ser avisado pela igreja

# member_change_password_header_title
source: Keep your account safe
es: Mantén tu cuenta segura
pt: Mantenha sua conta segura

# member_change_password_header_subtitle
source: Use a strong password and do not share your access data.
es: Usa una contraseña segura y no compartas tus datos de acceso.
pt: Use uma senha forte e não compartilhe seus dados de acesso.

# member_change_password_current_label
source: Current password
es: Contraseña actual
pt: Senha atual

# member_change_password_new_label
source: New password
es: Nueva contraseña
pt: Nova senha

# member_change_password_confirm_label
source: Confirm new password
es: Confirmar nueva contraseña
pt: Confirmar nova senha

# member_change_password_rule_length
source: At least 8 characters
es: Al menos 8 caracteres
pt: Pelo menos 8 caracteres

# member_change_password_rule_uppercase
source: 1 uppercase letter
es: 1 letra mayúscula
pt: 1 letra maiúscula

# member_change_password_rule_number
source: 1 number
es: 1 número
pt: 1 número

# member_change_password_error_current
source: Incorrect current password.
es: Contraseña actual incorrecta.
pt: Senha atual incorreta.

# member_change_password_error_match
source: Passwords do not match.
es: Las contraseñas no coinciden.
pt: As senhas não coincidem.

# member_change_password_success_title
source: Success!
es: ¡Éxito!
pt: Sucesso!

# member_change_password_success_message
source: Your password has been changed successfully.
es: Tu contraseña ha sido cambiada con éxito.
pt: Sua senha foi alterada com sucesso.

# member_change_password_btn_save
source: Save new password
es: Guardar nueva contraseña
pt: Salvar nova senha

# member_change_password_btn_cancel
source: Cancel
es: Cancelar
pt: Cancelar

# member_change_password_btn_back
source: Back to profile
es: Volver al perfil
pt: Voltar ao perfil

# member_commitments_installments_section_title
source: Installments
es: Cuotas
pt: Parcelas

# member_commitments_payment_modal_title
source: Register payment
es: Registrar pago
pt: Registrar pagamento

# member_commitments_payment_title
source: Register payment
es: Registrar pago
pt: Registrar pagamento

# member_commitments_payment_installment_label
source: Installment
es: Cuota
pt: Parcela

# member_commitments_payment_account_label
source: Availability account
es: Cuenta de disponibilidad
pt: Conta de disponibilidade

# member_commitments_payment_amount_label
source: Amount paid
es: Monto pagado
pt: Valor pago

# member_commitments_payment_paid_at_label
source: Payment date
es: Fecha del pago
pt: Data do pagamento

# member_commitments_payment_voucher_label
source: Payment receipt
es: Comprobante de pago
pt: Comprovante de pagamento

# member_commitments_payment_observation_label
source: Note (optional)
es: Observación (opcional)
pt: Observação (opcional)

# member_commitments_payment_submit
source: Send receipt
es: Enviar comprobante
pt: Enviar comprovante

# member_commitments_payment_success
source: Payment registered! The treasury will review the receipt.
es: ¡Pago registrado! Tesorería verificará el comprobante.
pt: Pagamento registrado com sucesso! A tesouraria irá verificar o comprovante.

# member_commitments_payment_required_fields_error
source: Select the installment, enter amount/date, and attach the receipt.
es: Indica la cuota, monto, fecha y adjunta el comprobante.
pt: Informe a parcela, valor, data e anexe o comprovante.

# member_commitments_payment_methods_title
source: How do you want to pay?
es: ¿Cómo quieres pagar?
pt: Como deseja pagar?

# member_commitments_payment_methods_pix
source: Pay with PIX
es: Pagar con PIX
pt: Pagar com PIX

# member_commitments_payment_methods_boleto
source: Generate boleto
es: Generar boleto
pt: Gerar boleto

# member_commitments_payment_methods_manual
source: I already paid, send receipt
es: Ya pagué, enviar comprobante
pt: Já paguei, enviar comprovante

# member_commitments_payment_methods_manual_hint
source: Use this option when you transferred and must send the receipt.
es: Usa esta opción cuando transferiste y necesitas enviar el comprobante.
pt: Use esta opção quando fizer uma transferência e precisar enviar o comprovante.

# member_commitments_installment_paid_on
source: Paid on: {date}
es: Pagado el: {date}
pt: Pago em: {date}

# member_commitments_installment_status_paid
source: Paid
es: Pagada
pt: Paga

# member_commitments_installment_status_pending
source: Pending
es: Pendiente
pt: Em aberto

# member_commitments_installment_status_in_review
source: Under review
es: En revisión
pt: Em revisão

# member_commitments_installment_status_partial
source: Partial payment
es: Pago parcial
pt: Pagamento parcial

# member_commitments_installment_status_overdue
source: Overdue
es: Vencida
pt: Vencida

# member_commitments_action_pay_installment
source: Pay installment
es: Pagar cuota
pt: Pagar parcela

# member_commitments_action_pay_this_installment
source: Pay this installment
es: Pagar esta cuota
pt: Pagar esta parcela

# member_commitments_payment_missing_account
source: Availability account not informed. Please contact your church.
es: Cuenta de disponibilidad no informada. Contacta a tu iglesia.
pt: Conta de disponibilidade não informada. Entre em contato com a igreja.

# member_register_name_label
source: Full name
es: Nombre completo
pt: Nome completo

# member_register_email_label
source: Email
es: Correo electrónico

# member_register_phone_label
source: Phone
es: Teléfono
pt: Telefone

# member_register_dni_label
source: Identity Document
es: Documento de identidad
pt: CPF

# member_register_conversion_date_label
source: Conversion date
es: Fecha de conversión
pt: Data de conversão

# member_register_baptism_date_label
source: Baptism date
es: Fecha de bautismo
pt: Data de batismo

# member_register_birthdate_label
source: Birthdate
es: Fecha de nacimiento
pt: Data de nascimento

# member_register_active_label
source: Active?
es: ¿Activo?
pt: Ativo?

# member_register_yes
source: Yes
es: Sí
pt: Sim

# validation_required
source: Required field
es: Campo obligatorio
pt: O campo é obrigatório

# validation_invalid_email
source: Invalid email
es: Correo electrónico inválido
pt: Email inválido

# validation_invalid_phone
source: Invalid phone format
es: Formato de teléfono inválido
pt: Formato de telefone inválido

# validation_invalid_cpf
source: Invalid ID document
es: Documento inválido
pt: CPF inválido

# member_list_title
source: Member list
es: Listado de miembros
pt: Listagem de membros

# member_list_action_register
source: Register new member
es: Registrar nuevo miembro
pt: Registrar novo membro

# member_list_empty
source: No members registered.
es: No hay miembros registrados.
pt: Não há membros cadastrados.

# member_list_header_name
source: Name
es: Nombre
pt: Nome

# member_list_header_email
source: Email
es: Correo electrónico

# member_list_header_phone
source: Phone
es: Teléfono
pt: Telefone

# member_list_header_birthdate
source: Birthdate
es: Fecha de nacimiento
pt: Data de nascimento

# member_list_header_active
source: Active?
es: ¿Activo?
pt: Ativo?

# member_list_action_edit
source: Edit
es: Editar
pt: Editar

# member_list_status_yes
source: Yes
es: Sí
pt: Sim

# trends_main_card_revenue_title
source: Gross Revenue
es: Ingresos Brutos
pt: Receita Bruta

# trends_main_card_revenue_subtitle
source: REVENUE
es: INGRESOS
pt: RECEITA

# trends_main_card_opex_title
source: Operating Expenses
es: Gastos Operativos
pt: Despesas Operacionais

# trends_main_card_opex_subtitle
source: EXPENSES
es: GASTOS
pt: DESPESAS

# trends_main_card_net_income_title
source: Period Result
es: Resultado del Período
pt: Resultado do Período

# trends_main_card_net_income_subtitle
source: RESULT
es: RESULTADO
pt: RESULTADO

# member_settings_title
source: Settings
es: Configuraciones
pt: Configurações

# member_settings_subtitle
source: Personalize your experience at Glória Finance - Members.
es: Personaliza tu experiencia en Glória Finance - Miembros.
pt: Personalize sua experiência na Glória Finance - Membros.

# member_settings_language_title
source: Interface Language
es: Idioma de la interfaz
pt: Idioma da interface

# member_settings_language_description
source: Choose the language you prefer to use in the app.
es: Elige el idioma que prefieres usar en la app.
pt: Escolha o idioma que prefere usar no app.

# member_settings_language_default_tag
source: Default
es: Predeterminado
pt: Padrão

# member_settings_notifications_title
source: Notifications
es: Notificaciones
pt: Notificações
