Repository: gloriafinance/gloria_finance_front
Catalog: lib/l10n/app_*.arb
Languages: es, pt

# month_january
source: January
es: Enero
pt: Janeiro

# month_february
source: February
es: Febrero
pt: Fevereiro

# month_march
source: March
es: Marzo
pt: Março

# month_april
source: April
es: Abril
pt: Abril

# month_may
source: May
es: Mayo
pt: Maio

# month_june
source: June
es: Junio
pt: Junho

# month_july
source: July
es: Julio
pt: Julho

# month_august
source: August
es: Agosto
pt: Agosto

# month_september
source: September
es: Septiembre
pt: Setembro

# month_october
source: October
es: Octubre
pt: Outubro

# month_november
source: November
es: Noviembre
pt: Novembro

# month_december
source: December
es: Diciembre
pt: Dezembro

# common_filters
source: Filters
es: Filtros
pt: Filtros

# common_filters_upper
source: FILTERS
es: FILTROS
pt: FILTROS

# common_all_banks
source: All banks
es: Todos los bancos
pt: Todos os bancos

# common_all_status
source: All statuses
es: Todos los estados
pt: Todos os status

# common_all_months
source: All months
es: Todos los meses
pt: Todos os meses

# common_all_years
source: All years
es: Todos los años
pt: Todos os anos

# common_bank
source: Bank
es: Banco
pt: Banco

# common_status
source: Status
es: Estado

# common_start_date
source: Start date
es: Fecha inicial
pt: Data inicial

# common_end_date
source: End date
es: Fecha final
pt: Data final

# common_month
source: Month
es: Mes
pt: Mês

# common_year
source: Year
es: Año
pt: Ano

# common_clear_filters
source: Clear filters
es: Limpiar filtros
pt: Limpar filtros

# common_loading
source: Loading...
es: Cargando...
pt: Carregando...

# common_apply_filters
source: Apply filters
es: Aplicar filtros
pt: Aplicar filtros

# common_load_more
source: Load more
es: Cargar más
pt: Carregar mais

# common_no_results_found
source: No results found
es: No se encontraron resultados
pt: Nenhum resultado encontrado

# common_search_hint
source: Search...
es: Buscar...
pt: Buscar...

# common_actions
source: Actions
es: Acciones
pt: Ações

# common_edit
source: Edit
es: Editar
pt: Editar

# auth_login_email_label
source: Email
es: Correo electrónico

# auth_login_password_label
source: Password
es: Contraseña
pt: Senha

# auth_login_forgot_password
source: Forgot your password?
es: ¿Olvidaste tu contraseña?
pt: Esqueceu a senha?

# auth_login_submit
source: Sign in
es: Iniciar sesión
pt: Entrar

# auth_login_error_invalid_email
source: Enter a valid email address
es: Introduce un correo electrónico válido
pt: Informe um e-mail válido

# auth_login_error_required_password
source: Enter your password
es: Introduce la contraseña
pt: Informe a senha

# auth_error_generic
source: An internal system error occurred, please contact your system administrator
es: Ocurrió un error interno en el sistema, informa al administrador del sistema
pt: Ocorreu um erro interno no sistema, informe ao administrador do sistema

# auth_recovery_request_title
source: Enter the email associated with your account and we will send you a temporary password.
es: Introduce el correo asociado a tu cuenta y te enviaremos una contraseña temporal.
pt: Digite o e-mail associado à sua conta e enviaremos um e-mail com uma senha temporária.

# auth_recovery_request_loading
source: Requesting temporary password
es: Solicitando contraseña temporal
pt: Solicitando senha temporária

# auth_recovery_request_submit
source: Send
es: Enviar
pt: Enviar

# auth_recovery_request_email_required
source: Email is required
es: El correo electrónico es obligatorio
pt: E-mail é obrigatório

# auth_recovery_change_title
source: Set a new password
es: Define una nueva contraseña
pt: Defina uma nova senha

# auth_recovery_change_description
source: Create a new password. Make sure it is different from previous ones for security
es: Crea una nueva contraseña. Asegúrate de que sea diferente de anteriores por seguridad
pt: Crie uma nova senha. Certifique-se de que seja diferente de anteriores para segurança

# auth_recovery_old_password_label
source: Current password
es: Contraseña anterior
pt: Senha anterior

# auth_recovery_new_password_label
source: New password
es: Nueva contraseña
pt: Nova senha

# auth_recovery_change_error_old_password_required
source: Enter your current password
es: Introduce la contraseña anterior
pt: Informe a senha antiga

# auth_recovery_change_error_new_password_required
source: Enter a new password
es: Introduce la nueva contraseña
pt: Informe a nova senha

# auth_recovery_change_error_min_length
source: The password must be at least 8 characters long
es: La contraseña debe tener al menos 8 caracteres
pt: A senha deve ter no mínimo 8 caracteres

# auth_recovery_change_error_lowercase
source: The password must contain at least one lowercase letter
es: La contraseña debe tener al menos una letra minúscula
pt: A senha deve ter no mínimo uma letra minúscula

# auth_recovery_change_error_uppercase
source: The password must contain at least one uppercase letter
es: La contraseña debe tener al menos una letra mayúscula
pt: A senha deve ter no mínimo uma letra maiúscula

# auth_recovery_change_error_number
source: The password must contain at least one number
es: La contraseña debe tener al menos un número
pt: A senha deve ter no mínimo um número

# auth_recovery_success_title
source: Check your email
es: Revisa tu correo electrónico
pt: Verifique seu e-mail

# auth_recovery_success_body
source: We sent a temporary password to {email}. If you do not see it, check your spam folder. If you have already received it, click the button below.
es: Enviamos una contraseña temporal al correo {email}. Si no la encuentras, revisa la carpeta de spam. Si ya la recibiste, haz clic en el botón de abajo.
pt: Enviamos uma senha temporaria no e-mail {email} se não encontrar verifique a caixa de spam. Se recebeu o e-mail, clique no botāo abaxio.

# auth_recovery_success_continue
source: Continue
es: Continuar
pt: Continuar

# auth_recovery_success_resend
source: Haven't received the email yet? Resend email
es: ¿Aún no recibiste el correo? Reenviar correo
pt: Ainda não recebeu o e-mail? Reenviar e-mail

# auth_recovery_success_resend_ok
source: Email resent successfully
es: Correo reenviado con éxito
pt: E-mail reenviado com sucesso

# auth_recovery_success_resend_error
source: Error while resending email
es: Error al reenviar el correo
pt: Erro ao reenviar e-mail

# auth_recovery_back_to_login
source: Back to login
es: Volver para iniciar sesión
pt: Voltar para fazer login

# auth_policies_title
source: Before continuing, please review and accept Glória Finance policies
es: Antes de continuar, revisa y acepta las políticas de Glória Finance
pt: Antes de continuar, revise e aceite as políticas do Glória Finance

# auth_policies_info_title
source: Important information:
es: Información importante:
pt: Informações importantes:

# auth_policies_info_body
source: • The church and Glória Finance process personal and sensitive data in order for the system to work. • In accordance with the Brazilian General Data Protection Law (LGPD), you must accept the policies below to continue using the platform. • Click the links to read the full text before accepting.
es: • La iglesia y Glória Finance tratan datos personales y sensibles para el funcionamiento del sistema. • En conformidad con la Ley General de Protección de Datos (LGPD), es necesario que aceptes las políticas a continuación para seguir utilizando la plataforma. • Haz clic en los enlaces para leer los textos completos antes de aceptar.
pt: • A igreja e o Glória Finance tratam dados pessoais e dados sensíveis para o funcionamento do sistema. • Em conformidade com a Lei Geral de Proteção de Dados (LGPD), é necessário que você aceite as políticas abaixo para continuar utilizando a plataforma. • Clique nos links para ler os textos completos antes de aceitar.

# auth_policies_privacy
source: Privacy Policy
es: Política de Privacidad
pt: Política de Privacidade

# auth_policies_sensitive
source: Sensitive Data Processing Policy
es: Política de Tratamiento de Datos Sensibles
pt: Política de Tratamento de Dados Sensíveis

# auth_policies_accept_and_continue
source: Accept and continue
es: Aceptar y continuar
pt: Aceitar e Continuar

# auth_policies_link_error
source: Could not open link: {url}
es: No fue posible abrir el enlace: {url}
pt: Não foi possível abrir o link: {url}

# auth_policies_checkbox_prefix
source: I have read and agree with the
es: He leído y estoy de acuerdo con la
pt: Li e concordo com a

# auth_layout_version_loading
source: Loading...
es: Cargando...
pt: Carregando...

# erp_menu_settings
source: Financial Settings
es: Configuración Financiera
pt: Configuraçōes

# erp_menu_settings_security
source: Security Settings
es: Configuración de seguridad

# erp_menu_settings_users_access
source: Users and access
es: Usuarios y acceso
pt: Usuários e acesso

# erp_menu_settings_roles_permissions
source: Roles and permissions
es: Roles y permisos
pt: Papéis e permissões

# erp_menu_settings_members
source: Members
es: Miembros
pt: Membros

# erp_menu_settings_financial_periods
source: Financial periods
es: Períodos financieros
pt: Períodos Financeiros

# erp_menu_settings_availability_accounts
source: Availability accounts
es: Cuentas de disponibilidad
pt: Contas de disponibilidade

# erp_menu_settings_banks
source: Banks
es: Bancos
pt: Bancos

# erp_menu_settings_cost_centers
source: Cost centers
es: Centros de costo
pt: Centros de custo

# erp_menu_settings_suppliers
source: Suppliers
es: Proveedores
pt: Fornecedores

# erp_menu_settings_financial_concepts
source: Financial concepts
es: Conceptos financieros
pt: Conceitos financeiros

# erp_menu_finance
source: Finance
es: Finanzas
pt: Finanzas

# erp_menu_finance_contributions
source: Contributions
es: Contribuciones
pt: Contribuiçōes

# erp_menu_finance_records
source: Financial records
es: Registros financieros
pt: Registro financeiros

# erp_menu_finance_bank_reconciliation
source: Bank reconciliation
es: Conciliación bancaria
pt: Conciliação bancária

# erp_menu_finance_accounts_receivable
source: Accounts receivable
es: Cuentas por cobrar
pt: Contas a receber

# erp_menu_finance_accounts_payable
source: Accounts payable
es: Cuentas por pagar
pt: Contas a pagar

# erp_menu_finance_purchases
source: Purchases
es: Compras
pt: Compras

# erp_menu_assets
source: Assets
es: Patrimonio
pt: Patrimônio

# erp_menu_assets_items
source: Asset items
es: Bienes patrimoniales
pt: Bens patrimoniais

# erp_menu_reports
source: Reports
es: Reportes
pt: Relatórios

# erp_menu_reports_monthly_tithes
source: Monthly tithes
es: Diezmos mensuales
pt: Dízimos mensais

# erp_menu_reports_income_statement
source: Income statement
es: Estado de resultados
pt: Estado de Ingresos

# common_cancel
source: Cancel
es: Cancelar
pt: Cancelar

# common_retry
source: Reload
es: Reintentar
pt: Recarregar

# common_processing
source: Processing...
es: Procesando...
pt: Processando...

# patrimony_assets_list_title
source: Assets
es: Patrimonio
pt: Patrimônio

# patrimony_assets_list_new
source: Register asset
es: Registrar bien
pt: Registrar bem

# patrimony_assets_filter_category
source: Category
es: Categoría
pt: Categoria

# patrimony_assets_table_error_loading
source: Could not load assets. Please try again.
es: No fue posible cargar los bienes. Intenta nuevamente.
pt: Não foi possível carregar os bens. Tente novamente.

# patrimony_assets_table_empty
source: No assets found for the selected filters.
es: No se encontró ningún bien con los filtros seleccionados.
pt: Nenhum bem encontrado com os filtros selecionados.

# patrimony_assets_table_header_code
source: Code
es: Código
pt: Código

# patrimony_assets_table_header_name
source: Name
es: Nombre
pt: Nome

# patrimony_assets_table_header_category
source: Category
es: Categoría
pt: Categoria

# patrimony_assets_table_header_value
source: Value
es: Valor
pt: Valor

# patrimony_assets_table_header_acquisition
source: Acquisition
es: Adquisición
pt: Aquisição

# patrimony_assets_table_header_location
source: Location
es: Ubicación
pt: Localização

# patrimony_inventory_import_file_label
source: Filled CSV file
es: Archivo CSV completado
pt: Arquivo CSV preenchido

# patrimony_inventory_import_file_size
source: Size: {size} KB
es: Tamaño: {size} KB
pt: Tamanho: {size} KB

# patrimony_inventory_import_description_title
source: Upload the completed physical checklist to update the assets.
es: Envía el checklist físico completado para actualizar los bienes.
pt: Envie o checklist físico preenchido para atualizar os bens.

# patrimony_inventory_import_description_body
source: Make sure the columns "Asset ID", "Inventory code" and "Inventory quantity" are filled in. Optional fields such as status and notes will also be processed when provided.
es: Asegúrate de mantener completas las columnas "ID del activo", "Código de inventario" y "Cantidad de inventario". Campos opcionales como estado y observaciones también se procesarán cuando se informen.
pt: Certifique-se de manter as colunas "ID do ativo", "Código inventário" e "Quantidade inventário" preenchidas. Campos opcionais como status e observações também serão processados, quando informados.

# patrimony_inventory_import_button_loading
source: Importing...
es: Importando...
pt: Importando...

# patrimony_inventory_import_button_submit
source: Import checklist
es: Importar checklist
pt: Importar checklist

# patrimony_inventory_import_error_no_file
source: Select the exported file before importing.
es: Selecciona el archivo exportado antes de importar.
pt: Selecione o arquivo exportado antes de importar.

# patrimony_inventory_import_error_read_file
source: Could not read the selected file.
es: No fue posible leer el archivo seleccionado.
pt: Não foi possível ler o arquivo selecionado.

# patrimony_inventory_import_error_generic
source: Could not import the checklist. Please try again.
es: No fue posible importar el checklist. Intenta nuevamente.
pt: Não foi possível importar o checklist. Tente novamente.

# patrimony_asset_detail_tab_details
source: Details
es: Detalles
pt: Detalhes

# patrimony_asset_detail_tab_history
source: History
es: Historial
pt: Histórico

# patrimony_asset_detail_category
source: Category
es: Categoría
pt: Categoria

# patrimony_asset_detail_quantity
source: Quantity
es: Cantidad
pt: Quantidade

# patrimony_asset_detail_acquisition_date
source: Acquisition date
es: Fecha de adquisición
pt: Data de aquisição

# patrimony_asset_detail_location
source: Location
es: Ubicación
pt: Localização

# patrimony_asset_detail_responsible
source: Responsible
es: Responsable
pt: Responsável

# patrimony_asset_detail_pending_documents
source: Pending documents
es: Documentos pendientes
pt: Documentos pendentes

# patrimony_asset_detail_notes
source: Notes
es: Observaciones
pt: Observações

# patrimony_asset_detail_quantity_badge
source: Qty: {quantity}
es: Cant.: {quantity}
pt: Qtd: {quantity}

# patrimony_asset_detail_updated_at
source: Updated at {date}
es: Actualizado el {date}
pt: Atualizado em {date}

# patrimony_asset_detail_inventory_register
source: Register inventory
es: Registrar inventario
pt: Registrar inventário

# patrimony_asset_detail_inventory_update
source: Update inventory
es: Actualizar inventario
pt: Atualizar inventário

# patrimony_asset_detail_inventory_modal_title
source: Register physical inventory
es: Registrar inventario físico
pt: Registrar inventário físico

# patrimony_asset_detail_inventory_success
source: Inventory registered successfully.
es: Inventario registrado con éxito.
pt: Inventário registrado com sucesso.

# patrimony_asset_detail_disposal_register
source: Register disposal
es: Registrar baja
pt: Registrar baixa

# patrimony_asset_detail_disposal_modal_title
source: Register disposal
es: Registrar baja
pt: Registrar baixa

# patrimony_asset_detail_disposal_success
source: Disposal registered
es: Baja registrada
pt: Baixa registrada

# patrimony_asset_detail_disposal_error
source: Error while registering disposal
es: Error al registrar la baja
pt: Erro ao registrar baixa

# patrimony_asset_detail_disposal_status
source: Status
es: Estado

# patrimony_asset_detail_disposal_reason
source: Reason
es: Motivo
pt: Motivo

# patrimony_asset_detail_disposal_date
source: Disposal date
es: Fecha de baja
pt: Data da baixa

# patrimony_asset_detail_disposal_performed_by
source: Registered by
es: Registrado por
pt: Registrado por

# patrimony_asset_detail_disposal_value
source: Disposal value
es: Valor de la baja
pt: Valor da baixa

# patrimony_asset_detail_inventory_result
source: Result
es: Resultado
pt: Resultado

# patrimony_asset_detail_inventory_checked_at
source: Check date
es: Fecha de la comprobación
pt: Data da conferência

# patrimony_asset_detail_inventory_checked_by
source: Checked by
es: Comprobado por
pt: Conferido por

# patrimony_asset_detail_inventory_title
source: Physical inventory
es: Inventario físico
pt: Inventário físico

# patrimony_asset_detail_attachments_empty
source: No attachments available.
es: No hay anexos disponibles.
pt: Nenhum anexo disponível.

# patrimony_asset_detail_attachments_title
source: Attachments
es: Anexos
pt: Anexos

# patrimony_asset_detail_attachment_view_pdf
source: View PDF
es: Ver PDF
pt: Ver PDF

# patrimony_asset_detail_attachment_open
source: Open
es: Abrir
pt: Abrir

# patrimony_asset_detail_history_empty
source: No change history.
es: Sin historial de cambios.
pt: Sem histórico de alterações.

# patrimony_asset_detail_history_title
source: Movement history
es: Historial de movimientos
pt: Histórico de movimentações

# patrimony_asset_detail_history_changes_title
source: Registered changes
es: Cambios registrados
pt: Alterações registradas

# patrimony_asset_detail_yes
source: Yes
es: Sí
pt: Sim

# erp_header_change_password
source: Change password
es: Cambiar contraseña
pt: Trocar senha

# erp_header_logout
source: Logout
es: Salir
pt: Sair

# auth_policies_submit_error_null
source: Could not register your acceptance. Please try again.
es: No fue posible registrar la aceptación. Intenta nuevamente.
pt: Não foi possível registrar o aceite. Tente novamente.

# auth_policies_submit_error_generic
source: An error occurred while registering your acceptance. Please try again.
es: Ocurrió un error al registrar la aceptación. Intenta nuevamente.
pt: Ocorreu um erro ao registrar o aceite. Tente novamente.

# auth_recovery_step_title_request
source: Send temporary password
es: Enviar contraseña temporal
pt: Enviar senha temporaria

# auth_recovery_step_title_confirm
source: Confirm receipt of temporary password
es: Confirmación de recepción de la contraseña temporal
pt: Confirmaçāo do recevimento da senha temporaria

# auth_recovery_step_title_new_password
source: Set new password
es: Definir nueva contraseña
pt: Definir nova senha

# erp_home_welcome_member
source: Welcome to Church Finance!\n\n
es: ¡Bienvenido a Church Finance!\n\n
pt: Seja bem-vindo ao Church Finance!\n\n

# erp_home_no_availability_accounts
source: No availability accounts found
es: No se encontró ninguna cuenta de disponibilidad
pt: Nenhuma conta de disponibilidade encontrada

# erp_home_availability_summary_title
source: Availability accounts summary
es: Resumen de cuentas de disponibilidad
pt: Resumo de contas de disponibilidade

# erp_home_availability_swipe_hint
source: Swipe to see all accounts
es: Desliza para ver todas las cuentas
pt: Deslize para ver todas as contas

# settings_banks_title
source: Banks
es: Bancos
pt: Bancos

# settings_banks_new_bank
source: New bank
es: Nuevo banco
pt: Novo banco

# settings_banks_form_title_create
source: New bank
es: Nuevo banco
pt: Novo banco

# settings_banks_form_title_edit
source: Edit bank
es: Editar banco
pt: Editar banco

# settings_banks_field_name
source: Name
es: Nombre
pt: Nome

# settings_banks_field_holder_name
source: Account holder name
es: Nombre del titular
pt: Nome do titular

# settings_banks_field_document_id
source: Document ID
es: Documento de identificación
pt: Documento

# settings_banks_field_account_type
source: Account type
es: Tipo de cuenta
pt: Tipo de conta

# settings_banks_field_pix_key
source: PIX key
es: Clave PIX
pt: Chave PIX

# settings_banks_field_bank_code
source: Bank code
es: Código del banco
pt: Código do banco

# settings_banks_field_agency
source: Branch
es: Agencia
pt: Agência

# settings_banks_field_account
source: Account
es: Cuenta
pt: Conta

# settings_banks_field_active
source: Active
es: Activo
pt: Ativo

# settings_banks_error_required
source: Required field
es: Campo obligatorio
pt: Campo obrigatório

# settings_banks_error_invalid_number
source: Enter a valid number
es: Ingrese un número válido
pt: Digite um número válido

# settings_banks_error_select_account_type
source: Select an account type
es: Selecciona el tipo de cuenta
pt: Selecione o tipo de conta

# settings_banks_save
source: Save
es: Guardar
pt: Salvar

# settings_banks_toast_saved
source: Record saved successfully
es: Registro guardado con éxito
pt: Registro salvo com sucesso

# settings_availability_list_title
source: Accounts list
es: Listado de cuentas
pt: Listagem de contas

# settings_availability_new_account
source: Availability account
es: Cuenta de disponibilidad
pt: Conta disponiblidade

# settings_availability_form_title
source: Register availability account
es: Registro de cuenta de disponibilidad
pt: Cadastro de conta de desponibilidade

# settings_availability_save
source: Save
es: Guardar
pt: Salvar

# settings_availability_toast_saved
source: Record saved successfully
es: Registro guardado con éxito
pt: Registro salvo com sucesso

# settings_availability_table_header_name
source: Account name
es: Nombre de la cuenta
pt: Nome da conta

# settings_availability_table_header_type
source: Account type
es: Tipo de cuenta
pt: Tipo de conta

# settings_availability_table_header_balance
source: Balance
es: Saldo
pt: Saldo

# settings_availability_table_header_status
source: Status
es: Estado

# settings_availability_view_title
source: Availability account #{id}
es: Cuenta de disponibilidad #{id}
pt: Conta de disponibilidade #{id}

# settings_availability_field_name
source: Name
es: Nombre
pt: Nome

# settings_availability_field_balance
source: Balance
es: Saldo
pt: Saldo

# settings_availability_field_type
source: Type
es: Tipo
pt: Tipo

# settings_availability_field_active
source: Active
es: Activa
pt: Ativa

# settings_availability_bank_details_title
source: Bank details
es: Datos del banco
pt: Dados do banco

# settings_availability_account_type_bank
source: Bank
es: Banco
pt: Banco

# settings_availability_account_type_cash
source: Cash
es: Efectivo
pt: Dinheiro

# settings_availability_account_type_wallet
source: Digital wallet
es: Billetera digital
pt: Carteira digital

# settings_availability_account_type_investment
source: Investment
es: Inversión
pt: Investimento

# settings_cost_center_title
source: Cost centers
es: Centros de costo
pt: Centros de custo

# settings_cost_center_new
source: New cost center
es: Nuevo centro de costo
pt: Novo centro de custo

# settings_cost_center_field_code
source: Code
es: Código
pt: Código

# settings_cost_center_field_name
source: Name
es: Nombre
pt: Nome

# settings_cost_center_field_category
source: Category
es: Categoría
pt: Categoria

# settings_cost_center_field_responsible
source: Responsible
es: Responsable
pt: Responsável

# settings_cost_center_field_description
source: Description
es: Descripción
pt: Descrição

# settings_cost_center_field_active
source: Active
es: Activo
pt: Ativo

# settings_cost_center_error_required
source: Required field
es: Campo obligatorio
pt: Campo obrigatório

# settings_cost_center_error_select_category
source: Select a category
es: Selecciona la categoría
pt: Selecione a categoria

# settings_cost_center_error_select_responsible
source: Select a responsible member
es: Selecciona el responsable
pt: Selecione o responsável
