Repository: gloriafinance/gloria_finance_front
Catalog: lib/l10n/app_*.arb
Languages: es, pt

# member_settings_notifications_description
source: Choose what you want to receive as alerts.
es: Elige lo que deseas recibir como aviso.
pt: Escolha o que você deseja receber como aviso.

# member_settings_notification_church_events_title
source: New Church Events
es: Nuevos eventos de la iglesia
pt: Novos eventos da igreja

# member_settings_notification_church_events_desc
source: Receive reminders for services, conferences, and special activities.
es: Recibir recordatorios de cultos, conferencias y actividades especiales.
pt: Receber lembretes de cultos, conferências e atividades especiais.

# member_settings_notification_payments_title
source: Payment Commitments
es: Compromisos de pago
pt: Compromissos de pagamento

# member_settings_notification_payments_desc
source: Alerts about installments and due dates of your commitments.
es: Avisos sobre cuotas y vencimientos de tus compromisos.
pt: Avisos sobre parcelas e vencimentos dos seus compromissos.

# member_settings_notification_contributions_status_title
source: Contribution Status
es: Estado de las contribuciones
pt: Status das contribuições

# member_settings_notification_contributions_status_desc
source: Notifications when a tithe or offering changes status (registered, confirmed, etc.).
es: Notificaciones cuando un diezmo u ofrenda cambia de estado (registrado, confirmado, etc.).
pt: Notificações quando um dízimo ou oferta muda de status (registrado, confirmado, etc.).

# member_settings_footer_coming_soon
source: Coming soon: more options to personalize your experience.
es: Próximamente: más opciones para personalizar tu experiencia.
pt: Em breve: mais opções para personalizar sua experiência.

# schedule_type_service
source: Service
es: Culto
pt: Culto

# schedule_type_cell
source: Cell
es: Célula
pt: Célula

# schedule_type_ministry_meeting
source: Ministry meeting
es: Reunión de ministerio
pt: Reunião de ministério

# schedule_type_regular_event
source: Regular event
es: Evento regular
pt: Evento regular

# schedule_type_other
source: Other
es: Otro
pt: Outro

# schedule_visibility_public
source: Public
es: Público
pt: Público

# schedule_visibility_internal_leaders
source: Leaders only
es: Solo líderes
pt: Somente líderes

# schedule_day_sunday
source: Sunday
es: Domingo
pt: Domingo

# schedule_day_monday
source: Monday
es: Lunes
pt: Segunda-feira

# schedule_day_tuesday
source: Tuesday
es: Martes
pt: Terça-feira

# schedule_day_wednesday
source: Wednesday
es: Miércoles
pt: Quarta-feira

# schedule_day_thursday
source: Thursday
es: Jueves
pt: Quinta-feira

# schedule_day_friday
source: Friday
es: Viernes
pt: Sexta-feira

# schedule_day_saturday
source: Saturday
es: Sábado
pt: Sábado

# schedule_list_title
source: Event schedule
es: Agenda de eventos
pt: Agenda de eventos

# schedule_list_new_button
source: New event
es: Nuevo evento
pt: Novo evento

# schedule_filters_title
source: Filters
es: Filtros
pt: Filtros

# schedule_filters_search
source: Search by title
es: Buscar por título
pt: Buscar por título

# schedule_filters_type
source: Event type
es: Tipo de evento
pt: Tipo de evento

# schedule_filters_visibility
source: Visibility
es: Visibilidad
pt: Visibilidade

# schedule_filters_status
source: Status
es: Estado

# schedule_filters_clear
source: Clear filters
es: Limpiar filtros
pt: Limpar filtros

# schedule_status_active
source: Active
es: Activo
pt: Ativo

# schedule_status_inactive
source: Inactive
es: Inactivo
pt: Inativo

# schedule_status_all
source: All
es: Todos
pt: Todos

# schedule_table_empty
source: No events found
es: No se encontró ningún evento
pt: Nenhum evento encontrado

# schedule_table_header_title
source: Title
es: Título
pt: Título

# schedule_table_header_type
source: Type
es: Tipo
pt: Tipo

# schedule_table_header_day
source: Day
es: Día
pt: Dia

# schedule_table_header_time
source: Time
es: Horario
pt: Horário

# schedule_table_header_location
source: Location
es: Ubicación
pt: Local

# schedule_table_header_director
source: Leader
es: Dirigente
pt: Dirigente

# schedule_action_reactivate
source: Reactivate
es: Reactivar
pt: Reativar

# schedule_action_deactivate
source: Deactivate
es: Desactivar
pt: Desativar

# schedule_delete_confirm_title
source: Confirm deactivation
es: Confirmar desactivación
pt: Confirmar desativação

# schedule_delete_confirm_message
source: Are you sure you want to deactivate this event?
es: ¿Estás seguro de que deseas desactivar este evento?
pt: Tem certeza de que deseja desativar este evento?

# schedule_reactivate_confirm_title
source: Confirm reactivation
es: Confirmar reactivación
pt: Confirmar reativação

# schedule_reactivate_confirm_message
source: Are you sure you want to reactivate this event?
es: ¿Estás seguro de que deseas reactivar este evento?
pt: Tem certeza que deseja reativar este evento?

# common_confirm
source: Confirm
es: Confirmar
pt: Confirmar

# schedule_detail_basic_info
source: Basic information
es: Información básica
pt: Informações básicas

# schedule_detail_title
source: Title
es: Título
pt: Título

# schedule_detail_type
source: Event type
es: Tipo de evento
pt: Tipo de evento

# schedule_detail_description
source: Description
es: Descripción
pt: Descrição

# schedule_detail_visibility
source: Visibility
es: Visibilidad
pt: Visibilidade

# schedule_detail_schedule_info
source: Schedule information
es: Información de horario
pt: Informações de horário

# schedule_detail_day
source: Day of week
es: Día de la semana
pt: Dia da semana

# schedule_detail_time
source: Time
es: Horario
pt: Horário

# schedule_detail_duration
source: Duration
es: Duración
pt: Duração

# schedule_detail_minutes
source: minutes
es: minutos
pt: minutos

# schedule_detail_start_date
source: Start date
es: Fecha de inicio
pt: Data de início

# schedule_detail_end_date
source: End date
es: Fecha de término
pt: Data de término

# schedule_detail_location_info
source: Location
es: Ubicación
pt: Local

# schedule_detail_location
source: Location name
es: Nombre del local
pt: Nome do local

# schedule_detail_address
source: Address
es: Dirección
pt: Endereço

# schedule_detail_responsibility
source: Responsibilities
es: Responsabilidades
pt: Responsabilidades

# schedule_detail_director
source: Leader
es: Dirigente
pt: Dirigente

# schedule_detail_preacher
source: Preacher
es: Predicador
pt: Pregador

# schedule_detail_observations
source: Observations
es: Observaciones
pt: Observações

# schedule_detail_summary
source: Summary
es: Resumen
pt: Resumo

# schedule_detail_when
source: When
es: Cuándo
pt: Quando

# schedule_detail_timezone
source: Timezone
es: Zona horaria
pt: Fuso

# schedule_detail_start
source: Start
es: Inicio
pt: Início

# schedule_detail_end
source: End
es: Término
pt: Término

# schedule_detail_no_end_date
source: No end date
es: Sin fecha de término
pt: Sem data de término

# schedule_detail_created_at
source: Created on
es: Creado en
pt: Criado em

# schedule_form_title_new
source: New event
es: Nuevo evento
pt: Novo evento

# schedule_form_title_edit
source: Edit event
es: Editar evento
pt: Editar evento

# schedule_form_section_basic
source: Basic information
es: Información básica
pt: Informações básicas

# schedule_form_section_location
source: Location
es: Ubicación
pt: Local

# schedule_form_section_recurrence
source: Recurrence
es: Recurrencia
pt: Recorrência

# schedule_form_section_visibility
source: Visibility
es: Visibilidad
pt: Visibilidade

# schedule_form_section_responsibility
source: Responsible
es: Responsables
pt: Responsáveis

# schedule_form_field_type
source: Event type
es: Tipo de evento
pt: Tipo de evento

# schedule_form_field_title
source: Title
es: Título
pt: Título

# schedule_form_field_description
source: Description (optional)
es: Descripción (opcional)
pt: Descrição (opcional)

# schedule_form_field_location_name
source: Location
es: Local
pt: Local

# schedule_form_field_location_address
source: Address (optional)
es: Dirección (opcional)
pt: Endereço (opcional)

# schedule_form_field_day_of_week
source: Day of week
es: Día de la semana
pt: Dia da semana

# schedule_form_field_time
source: Time
es: Horario
pt: Horário

# schedule_form_field_duration
source: Duration (minutes)
es: Duración (minutos)
pt: Duração (minutos)

# schedule_form_field_start_date
source: Start date
es: Fecha de inicio
pt: Data de início

# schedule_form_field_has_end_date
source: Set end date
es: Definir fecha de término
pt: Definir data de término

# schedule_form_field_end_date
source: End date
es: Fecha de término

# schedule_form_field_visibility
source: Who can see
es: Quién puede ver
pt: Quem pode ver

# schedule_form_field_director
source: Leader
es: Dirigente
pt: Dirigente

# schedule_form_field_preacher
source: Preacher (optional)
es: Predicador (opcional)
pt: Pregador (opcional)

# schedule_form_field_observations
source: Observations (optional)
es: Observaciones (opcional)
pt: Observações (opcional)

# schedule_form_save
source: Save
es: Guardar
pt: Salvar

# schedule_form_cancel
source: Cancel
es: Cancelar
pt: Cancelar

# schedule_form_title
source: Title
es: Título
pt: Título

# schedule_form_description
source: Description
es: Descripción
pt: Descrição

# schedule_form_type
source: Type
es: Tipo
pt: Tipo

# schedule_form_visibility
source: Visibility
es: Visibilidad
pt: Visibilidade

# schedule_form_start_time
source: Start time
es: Horario de inicio
pt: Horário de início

# schedule_form_end_time
source: End time
es: Horario de finalización
pt: Horário de término

# schedule_form_recurrence
source: Recurrence
es: Recurrencia
pt: Recorrência

# schedule_form_weekly_recurrence
source: Weekly recurrence
es: Recurrencia semanal
pt: Recorrência semanal

# schedule_day_abbr_sunday
source: Sun
es: Dom
pt: Dom

# schedule_day_abbr_monday
source: Mon
es: Lun
pt: Seg

# schedule_day_abbr_tuesday
source: Tue
es: Mar
pt: Ter

# schedule_day_abbr_wednesday
source: Wed
es: Mié
pt: Qua

# schedule_day_abbr_thursday
source: Thu
es: Jue
pt: Qui

# schedule_day_abbr_friday
source: Fri
es: Vie
pt: Sex

# schedule_day_abbr_saturday
source: Sat
es: Sáb
pt: Sáb

# schedule_form_is_active
source: Active
es: Activo
pt: Ativo

# schedule_form_error_required
source: This field is required
es: Este campo es obligatorio
pt: Este campo é obrigatório

# schedule_form_error_type_required
source: Select a type
es: Seleccione un tipo
pt: Selecione um tipo

# schedule_form_error_visibility_required
source: Select visibility
es: Seleccione la visibilidad
pt: Selecione a visibilidade

# schedule_form_error_day_required
source: Select day of week
es: Seleccione el día de la semana
pt: Selecione o dia da semana

# schedule_form_error_invalid_time
source: Invalid format. Use HH:MM
es: Formato inválido. Use HH:MM
pt: Formato inválido. Use HH:MM

# schedule_form_error_invalid_number
source: Enter a valid number
es: Ingrese un número válido
pt: Digite um número válido

# schedule_form_toast_saved
source: Event saved successfully!
es: ¡Evento guardado con éxito!
pt: Evento salvo com sucesso!

# schedule_form_error_title_required
source: Title is required
es: El título es obligatorio
pt: O título é obrigatório

# schedule_form_error_location_name_required
source: Location name is required
es: El nombre de la ubicación es obligatorio
pt: O nome do local é obrigatório

# schedule_form_error_director_required
source: Leader is required
es: El dirigente es obligatorio
pt: O dirigente é obrigatório

# schedule_form_error_duration_invalid
source: Duration must be greater than zero
es: La duración debe ser mayor que cero
pt: A duração deve ser maior que zero

# schedule_form_error_end_date_before_start
source: End date must be after start date
es: La fecha de término debe ser posterior a la fecha de inicio
pt: A data de término deve ser posterior à data de início

# schedule_form_toast_saved_success
source: Event saved successfully!
es: ¡Evento guardado con éxito!
pt: Evento salvo com sucesso!

# schedule_form_toast_saved_error
source: Error saving event
es: Error al guardar evento
pt: Erro ao salvar evento

# schedule_recurrence_none
source: No recurrence
es: Sin recurrencia
pt: Sem recorrência

# erp_menu_schedule
source: Schedule
es: Agenda
pt: Agenda

# erp_menu_schedule_events
source: Events and Schedule
es: Eventos y Horarios
pt: Eventos e Horários

# schedule_duplicate_title
source: Duplicate event
es: Duplicar evento
pt: Duplicar evento

# schedule_duplicate_subtitle
source: Create a new event based on: {originalTitle}
es: Crear un nuevo evento basado en: {originalTitle}
pt: Criar um novo evento baseado em: {originalTitle}

# schedule_duplicate_summary_title
source: Original event summary
es: Resumen del evento original
pt: Resumo do evento original

# schedule_duplicate_adjustments_title
source: Adjustments before creating
es: Ajustes antes de crear
pt: Ajustes antes de criar

# schedule_duplicate_open_edit
source: Open full edit after creating
es: Abrir edición completa después de crear
pt: Abrir edição completa após criar

# schedule_duplicate_action_create
source: Create copy
es: Crear copia
pt: Criar cópia

# schedule_duplicate_toast_success
source: Event duplicated successfully!
es: ¡Evento duplicado con éxito!
pt: Evento duplicado com sucesso!

# schedule_duplicate_toast_error
source: Error duplicating event
es: Error al duplicar evento
pt: Erro ao duplicar evento

# accountsPayable_help_cst_title
source: Tax Situation Code (CST)
es: Código de Situación Tributaria (CST)
pt: Código de Situação Tributária (CST)

# accountsPayable_help_cst_description
source: CST shows how the tax applies to the operation.
es: El CST muestra cómo se aplica el impuesto a la operación.
pt: O CST mostra como o imposto se aplica à operação.

# accountsPayable_help_cst_00
source: Full taxation (Normal ICMS)
es: Tributación integral (ICMS normal)
pt: Tributação integral (ICMS normal)

# accountsPayable_help_cst_10
source: Taxed with ICMS by substitution
es: Tributada con ICMS por sustitución
pt: Tributada com ICMS por substituição

# accountsPayable_help_cst_20
source: With tax base reduction
es: Con reducción de base de cálculo
pt: Com redução de base de cálculo

# accountsPayable_help_cst_40
source: Exempt or non-taxed
es: Exenta o no tributada
pt: Isenta ou não tributada

# accountsPayable_help_cst_60
source: ICMS previously charged via ST
es: ICMS cobrado anteriormente por ST
pt: ICMS cobrado anteriormente por ST

# accountsPayable_help_cst_90
source: Other specific situations
es: Otras situaciones específicas
pt: Outras situações específicas

# accountsPayable_help_cfop_title
source: Fiscal Operations Code (CFOP)
es: Código Fiscal de Operaciones (CFOP)
pt: Código Fiscal de Operações (CFOP)

# accountsPayable_help_cfop_description
source: CFOP describes the operation type (purchase, sale, service).
es: El CFOP describe el tipo de operación (compra, venta, servicio).
pt: O CFOP descreve o tipo de operação (compra, venda, serviço).

# accountsPayable_help_cfop_digit_info
source: First digit indicates origin/destination:
es: El primer dígito indica el orígen/destino:
pt: Primeiro dígito indica a origem/destino:

# accountsPayable_help_cfop_1xxx
source: In-state entries
es: Entradas dentro del estado
pt: Entradas dentro do estado

# accountsPayable_help_cfop_2xxx
source: Out-of-state entries
es: Entradas de otro estado
pt: Entradas de outro estado

# accountsPayable_help_cfop_5xxx
source: In-state exits
es: Salidas dentro del estado
pt: Saídas dentro do estado

# accountsPayable_help_cfop_6xxx
source: Out-of-state exits
es: Salidas para otro estado
pt: Saídas para outro estado

# accountsPayable_help_cfop_7xxx
source: International operations
es: Operaciones con el exterior
pt: Operações com o exterior

# accountsPayable_help_cfop_examples_title
source: Useful examples:
es: Ejemplos útiles:
pt: Exemplos úteis:

# accountsPayable_help_cfop_1101
source: Purchase for industrialization
es: Compra para industrialización
pt: Compra para industrialização

# accountsPayable_help_cfop_1556
source: Purchase for internal use/consumption
es: Compra para uso o consumo interno
pt: Compra para uso ou consumo interno

# accountsPayable_help_cfop_5405
source: Sale subject to tax substitution
es: Venta sujeta a sustitución tributaria
pt: Venda sujeita à substituição tributária

# accountsPayable_help_cfop_6102
source: Sale for commercialization out-of-state
es: Venta para comercialización fuera del estado
pt: Venda para comercialização fora do estado

# common_understood
source: Understood
es: Entendido
pt: Entendi

# bankStatements_link_dialog_title
source: Link Financial Record
es: Vincular registro financiero
pt: Vincular lançamento financeiro

# bankStatements_link_dialog_id_label
source: Financial Record ID
es: ID del registro financiero
pt: ID do lançamento financeiro

# bankStatements_link_dialog_id_error
source: Please enter the record identifier.
es: Informe el identificador del registro.
pt: Informe o identificador do lançamento.

# bankStatements_link_dialog_suggestions_title
source: Automatic Suggestions
es: Sugerencias automáticas
pt: Sugestões automáticas

# bankStatements_link_dialog_suggestions_error
source: Could not load suggestions. Please try again later.
es: No fue posible cargar sugerencias. Intente nuevamente más tarde.
pt: Não foi possível carregar sugestões. Tente novamente mais tarde.

# bankStatements_link_dialog_suggestions_empty
source: No record matches the amount and date.
es: Ningún registro corresponde al valor y fecha informados.
pt: Nenhum lançamento corresponde ao valor e data informados.

# bankStatements_link_dialog_use_id
source: Use ID
es: Usar ID
pt: Usar ID

# bankStatements_link_dialog_no_concept
source: No concept
es: Sin concepto
pt: Sem conceito

# bankStatements_link_dialog_saving
source: Saving...
es: Guardando...
pt: Salvando...

# bankStatements_link_dialog_link_button
source: Link
es: Vincular
pt: Vincular

# bankStatements_link_dialog_link_error
source: Could not link. Check the provided identifier.
es: No fue posible vincular. Verifique el identificador informado.
pt: Não foi possível vincular. Verifique o identificador informado.

# tax_form_title_add
source: Add Tax
es: Agregar impuesto
pt: Adicionar imposto

# tax_form_title_edit
source: Edit Tax
es: Editar impuesto
pt: Editar imposto

# tax_form_type_label
source: Tax Type
es: Tipo de impuesto
pt: Tipo do imposto

# tax_form_type_error
source: Enter tax type
es: Informe el tipo de impuesto
pt: Informe o tipo do imposto

# tax_form_percentage_label
source: Percentage (%)
es: Porcentaje (%)
pt: Percentual (%)

# tax_form_percentage_error
source: Enter a valid percentage
es: Informe un porcentaje válido
pt: Informe um percentual válido

# tax_form_amount_label
source: Retained Value
es: Valor retenido
pt: Valor retido

# tax_form_amount_error
source: Enter a value greater than zero
es: Informe un valor mayor que cero
pt: Informe um valor maior que zero

# tax_form_status_label
source: Status
es: Situación
pt: Situação

# tax_form_status_taxed
source: Taxed
es: Tributada
pt: Tributada

# tax_form_status_substitution
source: Tax Substitution
es: Sustitución tributaria
pt: Substituição tributária

# tax_form_empty_list
source: No taxes added yet.
es: Ningún impuesto agregado hasta el momento.
pt: Nenhum imposto adicionado até o momento.

# common_save
source: Save
es: Guardar
pt: Salvar

# patrimony_asset_detail_no
source: No
pt: Não

# member_shell_header_default_church
source: Gloria Finance
pt: Glória Finance

# member_register_no
source: No
pt: Não

# member_list_status_no
source: No
pt: Não
